#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   x   
; TexCoord                 0   xy          1     NONE   float    y  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: eb79d017d844c57e8990f00ba2e25a2c.pdb
; shader hash: eb79d017d844c57e8990f00ba2e25a2c
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer Constants
; {
;
;   struct Constants
;   {
;
;       uint2 TextureSize;                            ; Offset:    0
;       float kA;                                     ; Offset:    8
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !75)
!1 = !DIFile(filename: "Shaders\5CBicubicVerticalUpsamplePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !15, !26}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 44, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 44, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 46, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !17, templateParams: !23)
!17 = !{!18, !20, !21, !22}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !{!24, !25}
!24 = !DITemplateTypeParameter(name: "element", type: !19)
!25 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !28, templateParams: !31)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 30, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 30, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!32, !12}
!32 = !DITemplateTypeParameter(name: "element", type: !14)
!33 = !{!34, !51, !55, !56, !59, !60, !63, !67, !71, !72, !73, !74}
!34 = !DISubprogram(name: "main", scope: !1, file: !1, line: 40, type: !35, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !15, !45}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!24, !44}
!44 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !47, templateParams: !50)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 31, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 31, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !{!24, !12}
!51 = !DISubprogram(name: "GetBicubicFilterWeights", linkageName: "\01?GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !52, file: !52, line: 29, type: !53, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DIFile(filename: "Shaders/BicubicFilterFunctions.hlsli", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!15, !19, !19}
!55 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@MM@Z", scope: !52, file: !52, line: 24, type: !53, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMMM@Z", scope: !52, file: !52, line: 19, type: !57, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!19, !19, !19}
!59 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMMM@Z", scope: !52, file: !52, line: 14, type: !57, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@II@Z", scope: !1, file: !1, line: 34, type: !61, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!37, !13, !13}
!63 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !64, file: !64, line: 94, type: !65, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!65 = !DISubroutineType(types: !66)
!66 = !{!37, !37, !8}
!67 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !68, file: !68, line: 37, type: !69, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!69 = !DISubroutineType(types: !70)
!70 = !{!37, !37}
!71 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !64, file: !64, line: 71, type: !69, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !68, file: !68, line: 63, type: !69, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !68, file: !68, line: 75, type: !69, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !68, file: !68, line: 120, type: !69, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!75 = !{!76, !78, !80, !84, !89, !91, !93, !95, !97}
!76 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@Constants@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 30, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!78 = !DIGlobalVariable(name: "kA", linkageName: "\01?kA@Constants@@3MB", scope: !0, file: !1, line: 31, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!80 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 26, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 26, size: 128, align: 32, elements: !2, templateParams: !82)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "element", type: !38)
!84 = !DIGlobalVariable(name: "FilterWeights", scope: !51, file: !52, line: 34, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 2048, align: 32, elements: !87)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!87 = !{!88}
!88 = !DISubrange(count: 16)
!89 = !DIGlobalVariable(name: "FilterWeights.0", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.0", scope: !51, file: !52, line: 34, type: !90, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.0")
!90 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !85, size: 512, align: 4)
!91 = !DIGlobalVariable(name: "FilterWeights.1", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.1", scope: !51, file: !52, line: 34, type: !92, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.1")
!92 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !85, size: 512, align: 4, offset: 512)
!93 = !DIGlobalVariable(name: "FilterWeights.2", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.2", scope: !51, file: !52, line: 34, type: !94, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.2")
!94 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !85, size: 512, align: 4, offset: 1024)
!95 = !DIGlobalVariable(name: "FilterWeights.3", linkageName: "\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.3", scope: !51, file: !52, line: 34, type: !96, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetBicubicFilterWeights@@YA?AV?$vector@M$03@@MM@Z@4QBV2@B.3")
!96 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !85, size: 512, align: 4, offset: 1536)
!97 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !74, file: !68, line: 122, type: !98, isLocal: false, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !101, templateParams: !111)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !100, file: !1, line: 122, baseType: !19, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!111 = !{!24, !112, !113}
!112 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!113 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!114 = !{i32 2, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!117 = !{!"Shaders\5CBicubicVerticalUpsamplePS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A//--------------------------------------------------------------------------------------\0D\0A// Simple bicubic filter\0D\0A//\0D\0A// http://en.wikipedia.org/wiki/Bicubic_interpolation\0D\0A// http://http.developer.nvidia.com/GPUGems/gpugems_ch24.html\0D\0A//\0D\0A//--------------------------------------------------------------------------------------\0D\0A\0D\0A#include \22BicubicFilterFunctions.hlsli\22\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> ColorTex : register(t0);\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    uint2 TextureSize;\0D\0A    float kA;\0D\0A}\0D\0A\0D\0Afloat3 GetColor(uint s, uint t)\0D\0A{\0D\0A    return ColorTex[uint2(s, t)];\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main(float4 position : SV_Position, float2 uv : TexCoord0) : SV_Target0\0D\0A{\0D\0A    float2 t = uv * TextureSize + 0.5;\0D\0A    float2 f = frac(t);\0D\0A    int2 st = int2(position.x, t.y);\0D\0A\0D\0A    uint MaxHeight = TextureSize.y - 1;\0D\0A\0D\0A    uint t0 = max(st.y - 2, 0);\0D\0A    uint t1 = max(st.y - 1, 0);\0D\0A    uint t2 = min(st.y + 0, MaxHeight);\0D\0A    uint t3 = min(st.y + 1, MaxHeight);\0D\0A\0D\0A    float4 W = GetBicubicFilterWeights(f.y, kA);\0D\0A    float3 Color =\0D\0A        W.x * GetColor(st.x, t0) +\0D\0A        W.y * GetColor(st.x, t1) +\0D\0A        W.z * GetColor(st.x, t2) +\0D\0A        W.w * GetColor(st.x, t3);\0D\0A\0D\0A#ifdef GAMMA_SPACE\0D\0A        return Color;\0D\0A#else\0D\0A        return ApplyDisplayProfile(Color, DISPLAY_PLANE_FORMAT);\0D\0A#endif\0D\0A}\0D\0A"}
