#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: eed999c4d6af411968ad1aa0058dc145.pdb
; shader hash: eed999c4d6af411968ad1aa0058dc145
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer Constants
; {
;
;   struct Constants
;   {
;
;       uint2 TextureSize;                            ; Offset:    0
;       float A;                                      ; Offset:    8
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !76)
!1 = !DIFile(filename: "Shaders\5CBicubicUpsamplePS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 68, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 68, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 68, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 68, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 31, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 31, size: 128, align: 32, elements: !15, templateParams: !21)
!15 = !{!16, !18, !19, !20}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !14, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !17)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 30, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 30, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!31, !12}
!31 = !DITemplateTypeParameter(name: "element", type: !28)
!32 = !{!33, !50, !53, !56, !57, !60, !64, !68, !72, !73, !74, !75}
!33 = !DISubprogram(name: "main", scope: !1, file: !1, line: 64, type: !34, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !13, !44}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 31, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 31, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!22, !43}
!43 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !46, templateParams: !49)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !45, file: !1, line: 31, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !45, file: !1, line: 31, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !{!22, !12}
!50 = !DISubprogram(name: "GetWeights", linkageName: "\01?GetWeights@@YA?AV?$vector@M$03@@M@Z", scope: !1, file: !1, line: 44, type: !51, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!13, !17}
!53 = !DISubprogram(name: "W2", linkageName: "\01?W2@@YAMM@Z", scope: !1, file: !1, line: 39, type: !54, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DISubroutineType(types: !55)
!55 = !{!17, !17}
!56 = !DISubprogram(name: "W1", linkageName: "\01?W1@@YAMM@Z", scope: !1, file: !1, line: 34, type: !54, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubprogram(name: "Cubic", linkageName: "\01?Cubic@@YA?AV?$vector@M$02@@V?$vector@M$03@@V1@111@Z", scope: !1, file: !1, line: 49, type: !58, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!36, !13, !36, !36, !36, !36}
!60 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@II@Z", scope: !1, file: !1, line: 54, type: !61, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubroutineType(types: !62)
!62 = !{!36, !63, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 70, baseType: !28)
!64 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !65, file: !65, line: 94, type: !66, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{!36, !36, !8}
!68 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !69, file: !69, line: 37, type: !70, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!70 = !DISubroutineType(types: !71)
!71 = !{!36, !36}
!72 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !65, file: !65, line: 71, type: !70, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !69, file: !69, line: 63, type: !70, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !69, file: !69, line: 75, type: !70, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !69, file: !69, line: 120, type: !70, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!76 = !{!77, !79, !81, !85, !87}
!77 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@Constants@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 30, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!79 = !DIGlobalVariable(name: "A", linkageName: "\01?A@Constants@@3MB", scope: !0, file: !1, line: 31, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!81 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 25, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 25, size: 128, align: 32, elements: !2, templateParams: !83)
!83 = !{!84}
!84 = !DITemplateTypeParameter(name: "element", type: !37)
!85 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 26, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!87 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !75, file: !69, line: 122, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !91, templateParams: !101)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !90, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!101 = !{!22, !102, !103}
!102 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!103 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!104 = !{i32 2, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!107 = !{!"Shaders\5CBicubicUpsamplePS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A//--------------------------------------------------------------------------------------\0D\0A// Simple bicubic filter\0D\0A//\0D\0A// http://en.wikipedia.org/wiki/Bicubic_interpolation\0D\0A// http://http.developer.nvidia.com/GPUGems/gpugems_ch24.html\0D\0A//\0D\0A//--------------------------------------------------------------------------------------\0D\0A\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> ColorTex : register(t0);\0D\0ASamplerState BilinearClamp : register(s0);\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    uint2 TextureSize;\0D\0A    float A;\0D\0A}\0D\0A\0D\0Afloat W1(float x)\0D\0A{\0D\0A    return x * x * ((A + 2) * x - (A + 3)) + 1.0;\0D\0A}\0D\0A\0D\0Afloat W2(float x)\0D\0A{\0D\0A    return A * (x * (x * (x - 5) + 8) - 4);\0D\0A}\0D\0A\0D\0Afloat4 GetWeights(float d1)\0D\0A{\0D\0A    return float4(W2(1.0 + d1), W1(d1), W1(1.0 - d1), W2(2.0 - d1));\0D\0A}\0D\0A\0D\0Afloat3 Cubic(float4 w, float3 c0, float3 c1, float3 c2, float3 c3)\0D\0A{\0D\0A    return c0 * w.x + c1 * w.y + c2 * w.z + c3 * w.w;\0D\0A}\0D\0A\0D\0Afloat3 GetColor(uint s, uint t)\0D\0A{\0D\0A#ifdef GAMMA_SPACE\0D\0A    return ApplyDisplayProfile(ColorTex[uint2(s, t)], DISPLAY_PLANE_FORMAT);\0D\0A#else\0D\0A    return ColorTex[uint2(s, t)];\0D\0A#endif\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main(float4 position : SV_Position, float2 uv : TexCoord0) : SV_Target0\0D\0A{\0D\0A    float2 t = uv * TextureSize + 0.5;\0D\0A    float2 f = frac(t);\0D\0A    int2 st = int2(t);\0D\0A\0D\0A    uint MaxWidth = TextureSize.x - 1;\0D\0A    uint MaxHeight = TextureSize.y - 1;\0D\0A\0D\0A    uint s0 = max(st.x - 2, 0);\0D\0A    uint s1 = max(st.x - 1, 0);\0D\0A    uint s2 = min(st.x + 0, MaxWidth);\0D\0A    uint s3 = min(st.x + 1, MaxWidth);\0D\0A\0D\0A    uint t0 = max(st.y - 2, 0);\0D\0A    uint t1 = max(st.y - 1, 0);\0D\0A    uint t2 = min(st.y + 0, MaxHeight);\0D\0A    uint t3 = min(st.y + 1, MaxHeight);\0D\0A\0D\0A    float4 Weights = GetWeights(f.x);\0D\0A    float3 c0 = Cubic(Weights, GetColor(s0, t0), GetColor(s1, t0), GetColor(s2, t0), GetColor(s3, t0));\0D\0A    float3 c1 = Cubic(Weights, GetColor(s0, t1), GetColor(s1, t1), GetColor(s2, t1), GetColor(s3, t1));\0D\0A    float3 c2 = Cubic(Weights, GetColor(s0, t2), GetColor(s1, t2), GetColor(s2, t2), GetColor(s3, t2));\0D\0A    float3 c3 = Cubic(Weights, GetColor(s0, t3), GetColor(s1, t3), GetColor(s2, t3), GetColor(s3, t3));\0D\0A    float3 Color = Cubic(GetWeights(f.y), c0, c1, c2, c3);\0D\0A\0D\0A#ifdef GAMMA_SPACE\0D\0A    return Color;\0D\0A#else\0D\0A    return ApplyDisplayProfile(Color, DISPLAY_PLANE_FORMAT);\0D\0A#endif\0D\0A}\0D\0A"}
