#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 1026d83557801ba16aa42c9ae980a0ce.pdb
; shader hash: 1026d83557801ba16aa42c9ae980a0ce
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float FocusCenter;                            ; Offset:    0
;       float FocalSpread;                            ; Offset:    4
;       float FocalMinDist;                           ; Offset:    8
;       float FocalMaxDist;                           ; Offset:   12
;       float2 RcpBufferDim;                          ; Offset:   16
;       uint2 FullDimension;                          ; Offset:   24
;       int2 HalfDimensionMinusOne;                   ; Offset:   32
;       uint2 TiledDimension;                         ; Offset:   40
;       float2 InvTiledDimension;                     ; Offset:   48
;       uint DebugMode;                               ; Offset:   56
;       uint DisablePreFilter;                        ; Offset:   60
;       float ForegroundRange;                        ; Offset:   64
;       float RcpForegroundRange;                     ; Offset:   68

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !63)
!1 = !DIFile(filename: "Shaders\5CDoFPass2CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 105, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 105, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !{!26, !37, !47, !51, !52, !58, !61, !62}
!26 = !DISubprogram(name: "main", scope: !1, file: !1, line: 78, type: !27, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29, !29}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 25, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 25, size: 96, align: 32, elements: !31, templateParams: !35)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!11, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!37 = !DISubprogram(name: "PrefetchPixel", linkageName: "\01?PrefetchPixel@@YAXV?$vector@H$01@@V?$vector@I$01@@MM@Z", scope: !1, file: !1, line: 27, type: !38, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40, !4, !18, !18}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 30, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 30, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 30, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!46, !12}
!46 = !DITemplateTypeParameter(name: "element", type: !13)
!47 = !DISubprogram(name: "ForegroundPercent", linkageName: "\01?ForegroundPercent@@YAMMM@Z", scope: !48, file: !48, line: 70, type: !49, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DIFile(filename: "Shaders/DoFCommon.hlsli", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!18, !18, !18}
!51 = !DISubprogram(name: "BackgroundPercent", linkageName: "\01?BackgroundPercent@@YAMMM@Z", scope: !48, file: !48, line: 65, type: !49, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubprogram(name: "AccumulateOneRing", linkageName: "\01?AccumulateOneRing@@YAXIAIAV?$vector@M$03@@0@Z", scope: !1, file: !1, line: 55, type: !53, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !56, !56}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !8)
!56 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !14)
!58 = !DISubprogram(name: "AccumulateSample", linkageName: "\01?AccumulateSample@@YAXIMAIAV?$vector@M$03@@0@Z", scope: !1, file: !1, line: 41, type: !59, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !55, !18, !56, !56}
!61 = !DISubprogram(name: "AccumulateTwoRings", linkageName: "\01?AccumulateTwoRings@@YAXIAIAV?$vector@M$03@@0@Z", scope: !1, file: !1, line: 62, type: !53, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubprogram(name: "AccumulateThreeRings", linkageName: "\01?AccumulateThreeRings@@YAXIAIAV?$vector@M$03@@0@Z", scope: !1, file: !1, line: 69, type: !53, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!63 = !{!64, !66, !67, !68, !69, !77, !79, !81, !82, !83, !85, !86, !87, !88, !89, !93, !94, !95, !97, !98, !99, !103, !107, !111, !114, !116, !118, !128, !129, !130, !133, !135}
!64 = !DIGlobalVariable(name: "FocusCenter", linkageName: "\01?FocusCenter@CB0@@3MB", scope: !0, file: !48, line: 24, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!66 = !DIGlobalVariable(name: "FocalSpread", linkageName: "\01?FocalSpread@CB0@@3MB", scope: !0, file: !48, line: 25, type: !65, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "FocalMinDist", linkageName: "\01?FocalMinDist@CB0@@3MB", scope: !0, file: !48, line: 26, type: !65, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "FocalMaxDist", linkageName: "\01?FocalMaxDist@CB0@@3MB", scope: !0, file: !48, line: 27, type: !65, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "RcpBufferDim", linkageName: "\01?RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !48, line: 28, type: !70, isLocal: false, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !73, templateParams: !76)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !72, file: !1, line: 28, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !72, file: !1, line: 28, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!76 = !{!23, !12}
!77 = !DIGlobalVariable(name: "FullDimension", linkageName: "\01?FullDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !48, line: 29, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!79 = !DIGlobalVariable(name: "HalfDimensionMinusOne", linkageName: "\01?HalfDimensionMinusOne@CB0@@3V?$vector@H$01@@B", scope: !0, file: !48, line: 30, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!81 = !DIGlobalVariable(name: "TiledDimension", linkageName: "\01?TiledDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !48, line: 31, type: !78, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "InvTiledDimension", linkageName: "\01?InvTiledDimension@CB0@@3V?$vector@M$01@@B", scope: !0, file: !48, line: 32, type: !70, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "DebugMode", linkageName: "\01?DebugMode@CB0@@3IB", scope: !0, file: !48, line: 33, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!85 = !DIGlobalVariable(name: "DisablePreFilter", linkageName: "\01?DisablePreFilter@CB0@@3IB", scope: !0, file: !48, line: 34, type: !84, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "ForegroundRange", linkageName: "\01?ForegroundRange@CB0@@3MB", scope: !0, file: !48, line: 35, type: !65, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "RcpForegroundRange", linkageName: "\01?RcpForegroundRange@CB0@@3MB", scope: !0, file: !48, line: 36, type: !65, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "AntiSparkleFilterStrength", linkageName: "\01?AntiSparkleFilterStrength@CB0@@3MB", scope: !0, file: !48, line: 37, type: !65, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gs_RG", linkageName: "\01?gs_RG@@3PAIA", scope: !0, file: !1, line: 23, type: !90, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_RG@@3PAIA")
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 18432, align: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 576)
!93 = !DIGlobalVariable(name: "gs_BW", linkageName: "\01?gs_BW@@3PAIA", scope: !0, file: !1, line: 24, type: !90, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_BW@@3PAIA")
!94 = !DIGlobalVariable(name: "gs_CF", linkageName: "\01?gs_CF@@3PAIA", scope: !0, file: !1, line: 25, type: !90, isLocal: false, isDefinition: true, variable: [576 x i32] addrspace(3)* @"\01?gs_CF@@3PAIA")
!95 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !48, line: 18, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!97 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !48, line: 19, type: !96, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "BilinearSampler", linkageName: "\01?BilinearSampler@@3USamplerState@@A", scope: !0, file: !48, line: 20, type: !96, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "s_Ring1", scope: !0, file: !48, line: 94, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 8)
!103 = !DIGlobalVariable(name: "s_Ring2", scope: !0, file: !48, line: 102, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1024, align: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIGlobalVariable(name: "s_Ring3", scope: !0, file: !48, line: 114, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1536, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 24)
!111 = !DIGlobalVariable(name: "s_Ring1Q", scope: !0, file: !48, line: 130, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 256, align: 32, elements: !101)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!114 = !DIGlobalVariable(name: "s_Ring2Q", scope: !0, file: !48, line: 138, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 512, align: 32, elements: !105)
!116 = !DIGlobalVariable(name: "s_Ring3Q", scope: !0, file: !48, line: 150, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 768, align: 32, elements: !109)
!118 = !DIGlobalVariable(name: "ColorBuffer", linkageName: "\01?ColorBuffer@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 16, type: !119, isLocal: false, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 16, size: 128, align: 32, elements: !2, templateParams: !120)
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "element", type: !122)
!122 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !123, templateParams: !127)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !122, file: !1, line: 16, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !122, file: !1, line: 16, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !122, file: !1, line: 16, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!127 = !{!23, !36}
!128 = !DIGlobalVariable(name: "PresortBuffer", linkageName: "\01?PresortBuffer@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !119, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "TileClass", linkageName: "\01?TileClass@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 18, type: !119, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "WorkQueue", linkageName: "\01?WorkQueue@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 19, type: !131, isLocal: false, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 19, size: 32, align: 32, elements: !2, templateParams: !132)
!132 = !{!11}
!133 = !DIGlobalVariable(name: "OutputColor", linkageName: "\01?OutputColor@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 20, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 20, size: 96, align: 32, elements: !2, templateParams: !120)
!135 = !DIGlobalVariable(name: "OutputAlpha", linkageName: "\01?OutputAlpha@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 21, type: !136, isLocal: false, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 21, size: 32, align: 32, elements: !2, templateParams: !137)
!137 = !{!23}
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
