#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: aba1dbe5c415ab4b10e49febf92e2124.pdb
; shader hash: aba1dbe5c415ab4b10e49febf92e2124
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float FocusCenter;                            ; Offset:    0
;       float FocalSpread;                            ; Offset:    4
;       float FocalMinDist;                           ; Offset:    8
;       float FocalMaxDist;                           ; Offset:   12
;       float2 RcpBufferDim;                          ; Offset:   16
;       uint2 FullDimension;                          ; Offset:   24
;       int2 HalfDimensionMinusOne;                   ; Offset:   32
;       uint2 TiledDimension;                         ; Offset:   40
;       float2 InvTiledDimension;                     ; Offset:   48
;       uint DebugMode;                               ; Offset:   56
;       uint DisablePreFilter;                        ; Offset:   60
;       float ForegroundRange;                        ; Offset:   64
;       float RcpForegroundRange;                     ; Offset:   68

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !85)
!1 = !DIFile(filename: "Shaders\5CDoFPreFilterFastCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 109, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 109, size: 96, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 109, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 109, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 109, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !18)
!23 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 104, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 104, size: 128, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !28, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 104, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 104, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 104, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !25, file: !1, line: 104, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!31 = !{!22, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!33 = !{!34, !45, !55, !58, !62, !65, !68, !75, !78, !79, !82}
!34 = !DISubprogram(name: "main", scope: !1, file: !1, line: 87, type: !35, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !44, !37, !37}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 27, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 27, size: 96, align: 32, elements: !39, templateParams: !43)
!39 = !{!40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !1, line: 27, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !38, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !38, file: !1, line: 27, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !{!11, !23}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 33, baseType: !8)
!45 = !DISubprogram(name: "LoadBlurriestSample", linkageName: "\01?LoadBlurriestSample@@YAXIV?$vector@H$01@@@Z", scope: !1, file: !1, line: 71, type: !46, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !44, !48}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 30, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 30, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 30, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!54, !12}
!54 = !DITemplateTypeParameter(name: "element", type: !13)
!55 = !DISubprogram(name: "WeightByInverseLuminance", linkageName: "\01?WeightByInverseLuminance@@YA?AV?$vector@M$03@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 40, type: !56, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!24, !14}
!58 = !DISubprogram(name: "Max4", linkageName: "\01?Max4@@YAMV?$vector@M$03@@@Z", scope: !59, file: !59, line: 52, type: !60, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DIFile(filename: "Shaders/DoFCommon.hlsli", directory: "")
!60 = !DISubroutineType(types: !61)
!61 = !{!18, !24}
!62 = !DISubprogram(name: "Max4", linkageName: "\01?Max4@@YAMMMMM@Z", scope: !59, file: !59, line: 50, type: !63, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!18, !18, !18, !18, !18}
!65 = !DISubprogram(name: "Max3", linkageName: "\01?Max3@@YAMMMM@Z", scope: !59, file: !59, line: 47, type: !66, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!18, !18, !18, !18}
!68 = !DISubprogram(name: "LoadSample", linkageName: "\01?LoadSample@@YAXAIAV?$vector@M$03@@AIAMI@Z", scope: !1, file: !1, line: 29, type: !69, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !73, !44}
!71 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !24)
!73 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!75 = !DISubprogram(name: "ComputeCoC", linkageName: "\01?ComputeCoC@@YAMM@Z", scope: !59, file: !59, line: 55, type: !76, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!18, !18}
!78 = !DISubprogram(name: "SampleAlpha", linkageName: "\01?SampleAlpha@@YAMM@Z", scope: !59, file: !59, line: 81, type: !76, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubprogram(name: "AccumulateOneRing", linkageName: "\01?AccumulateOneRing@@YA?AV?$vector@M$03@@IM@Z", scope: !1, file: !1, line: 53, type: !80, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!24, !44, !18}
!82 = !DISubprogram(name: "GetSample", linkageName: "\01?GetSample@@YA?AV?$vector@M$03@@I@Z", scope: !1, file: !1, line: 46, type: !83, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!24, !44}
!85 = !{!86, !88, !89, !90, !91, !99, !101, !103, !104, !105, !107, !108, !109, !110, !111, !115, !116, !118, !120, !121, !122, !126, !130, !134, !137, !139, !141, !144, !148, !149, !152, !154}
!86 = !DIGlobalVariable(name: "FocusCenter", linkageName: "\01?FocusCenter@CB0@@3MB", scope: !0, file: !59, line: 24, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!88 = !DIGlobalVariable(name: "FocalSpread", linkageName: "\01?FocalSpread@CB0@@3MB", scope: !0, file: !59, line: 25, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "FocalMinDist", linkageName: "\01?FocalMinDist@CB0@@3MB", scope: !0, file: !59, line: 26, type: !87, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "FocalMaxDist", linkageName: "\01?FocalMaxDist@CB0@@3MB", scope: !0, file: !59, line: 27, type: !87, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "RcpBufferDim", linkageName: "\01?RcpBufferDim@CB0@@3V?$vector@M$01@@B", scope: !0, file: !59, line: 28, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !95, templateParams: !98)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !94, file: !1, line: 28, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !94, file: !1, line: 28, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !{!22, !12}
!99 = !DIGlobalVariable(name: "FullDimension", linkageName: "\01?FullDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !59, line: 29, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!101 = !DIGlobalVariable(name: "HalfDimensionMinusOne", linkageName: "\01?HalfDimensionMinusOne@CB0@@3V?$vector@H$01@@B", scope: !0, file: !59, line: 30, type: !102, isLocal: false, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!103 = !DIGlobalVariable(name: "TiledDimension", linkageName: "\01?TiledDimension@CB0@@3V?$vector@I$01@@B", scope: !0, file: !59, line: 31, type: !100, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "InvTiledDimension", linkageName: "\01?InvTiledDimension@CB0@@3V?$vector@M$01@@B", scope: !0, file: !59, line: 32, type: !92, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "DebugMode", linkageName: "\01?DebugMode@CB0@@3IB", scope: !0, file: !59, line: 33, type: !106, isLocal: false, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!107 = !DIGlobalVariable(name: "DisablePreFilter", linkageName: "\01?DisablePreFilter@CB0@@3IB", scope: !0, file: !59, line: 34, type: !106, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "ForegroundRange", linkageName: "\01?ForegroundRange@CB0@@3MB", scope: !0, file: !59, line: 35, type: !87, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "RcpForegroundRange", linkageName: "\01?RcpForegroundRange@CB0@@3MB", scope: !0, file: !59, line: 36, type: !87, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "AntiSparkleFilterStrength", linkageName: "\01?AntiSparkleFilterStrength@CB0@@3MB", scope: !0, file: !59, line: 37, type: !87, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "RGBuffer", linkageName: "\01?RGBuffer@@3PAIA", scope: !0, file: !1, line: 25, type: !112, isLocal: false, isDefinition: true, variable: [100 x i32] addrspace(3)* @"\01?RGBuffer@@3PAIA")
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 3200, align: 32, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 100)
!115 = !DIGlobalVariable(name: "BWBuffer", linkageName: "\01?BWBuffer@@3PAIA", scope: !0, file: !1, line: 26, type: !112, isLocal: false, isDefinition: true, variable: [100 x i32] addrspace(3)* @"\01?BWBuffer@@3PAIA")
!116 = !DIGlobalVariable(name: "DepthBuffer", linkageName: "\01?DepthBuffer@@3PAMA", scope: !0, file: !1, line: 27, type: !117, isLocal: false, isDefinition: true, variable: [100 x float] addrspace(3)* @"\01?DepthBuffer@@3PAMA")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3200, align: 32, elements: !113)
!118 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !59, line: 18, type: !119, isLocal: false, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 18, size: 32, align: 32, elements: !2)
!120 = !DIGlobalVariable(name: "ClampSampler", linkageName: "\01?ClampSampler@@3USamplerState@@A", scope: !0, file: !59, line: 19, type: !119, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "BilinearSampler", linkageName: "\01?BilinearSampler@@3USamplerState@@A", scope: !0, file: !59, line: 20, type: !119, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "s_Ring1", scope: !0, file: !59, line: 94, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, align: 32, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 8)
!126 = !DIGlobalVariable(name: "s_Ring2", scope: !0, file: !59, line: 102, type: !127, isLocal: true, isDefinition: true)
