#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: cf7ced31a1d66128ccff6f33eee844aa.pdb
; shader hash: cf7ced31a1d66128ccff6f33eee844aa
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint SrcMipLevel;                             ; Offset:    0
;       uint NumMipLevels;                            ; Offset:    4
;       float2 TexelSize;                             ; Offset:    8
;   
;   } CB0;                                            ; Offset:    0 Size:    16
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1
; BilinearClamp                     sampler      NA          NA      S0             s0     1
; SrcMip                            texture     f32          2d      T0             t0     1
; OutMip1                               UAV     f32          2d      U0             u0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !58)
!1 = !DIFile(filename: "Shaders\5CGenerateMipsGammaOddYCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 100, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 100, size: 128, align: 32, elements: !16, templateParams: !21)
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 100, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!21 = !{!11, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!23 = !{!24, !39, !42, !52, !55}
!24 = !DISubprogram(name: "main", scope: !25, file: !25, line: 75, type: !26, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DIFile(filename: "Shaders/GenerateMipsCS.hlsli", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !30}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 29, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 40, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 40, size: 96, align: 32, elements: !32, templateParams: !36)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !1, line: 40, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !1, line: 40, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !1, line: 40, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !{!37, !38}
!37 = !DITemplateTypeParameter(name: "element", type: !29)
!38 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!39 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !25, file: !25, line: 64, type: !40, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!14, !14}
!42 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !25, file: !25, line: 55, type: !43, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !45}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 71, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 71, size: 96, align: 32, elements: !47, templateParams: !51)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 71, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !46, file: !1, line: 71, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!51 = !{!11, !38}
!52 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !25, file: !25, line: 42, type: !53, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !28, !14}
!55 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !25, file: !25, line: 50, type: !56, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!14, !28}
!58 = !{!59, !61, !62, !64, !68, !69, !70, !71, !75, !76, !77, !78, !80}
!59 = !DIGlobalVariable(name: "SrcMipLevel", linkageName: "\01?SrcMipLevel@CB0@@3IB", scope: !0, file: !25, line: 29, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!61 = !DIGlobalVariable(name: "NumMipLevels", linkageName: "\01?NumMipLevels@CB0@@3IB", scope: !0, file: !25, line: 30, type: !60, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "TexelSize", linkageName: "\01?TexelSize@CB0@@3V?$vector@M$01@@B", scope: !0, file: !25, line: 31, type: !63, isLocal: false, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!64 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !25, line: 37, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 64)
!68 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !25, line: 38, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!69 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !25, line: 39, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!70 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !25, line: 40, type: !65, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!71 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 20, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 20, size: 128, align: 32, elements: !2, templateParams: !73)
!73 = !{!74}
!74 = !DITemplateTypeParameter(name: "element", type: !15)
!75 = !DIGlobalVariable(name: "OutMip2", linkageName: "\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 21, type: !72, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "OutMip3", linkageName: "\01?OutMip3@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 22, type: !72, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "OutMip4", linkageName: "\01?OutMip4@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 23, type: !72, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 24, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 24, size: 160, align: 32, elements: !2, templateParams: !73)
!80 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !25, line: 25, type: !81, isLocal: false, isDefinition: true)
