#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float    y  
; TexCoord                 0   xy          1     NONE   float   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 3aebed402d9011f6caed2cebc41d8d0a.pdb
; shader hash: 3aebed402d9011f6caed2cebc41d8d0a
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       float2 kSrcResolution;                        ; Offset:    0
;   
;   } CB0;                                            ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !42, globals: !83)
!1 = !DIFile(filename: "Shaders\5CLanczosHorizontalPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !21, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 45, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 45, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 45, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 45, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 45, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 45, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 45, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 63, baseType: !8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 45, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 45, size: 384, align: 32, elements: !24, templateParams: !38)
!24 = !{!25, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !23, file: !1, line: 45, baseType: !26, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!38 = !{!39, !40, !41}
!39 = !DITemplateTypeParameter(name: "element", type: !26)
!40 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!41 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!42 = !{!43, !69, !73, !74, !77, !80}
!43 = !DISubprogram(name: "main", scope: !1, file: !1, line: 33, type: !44, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !54, !63}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 23, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 23, size: 96, align: 32, elements: !48, templateParams: !52)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !47, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !47, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !{!39, !53}
!53 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 23, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 23, size: 128, align: 32, elements: !56, templateParams: !61)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !55, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !55, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !{!39, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 23, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 23, size: 64, align: 32, elements: !65, templateParams: !68)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !64, file: !1, line: 23, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !64, file: !1, line: 23, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !{!39, !12}
!69 = !DISubprogram(name: "GetUpscaleFilterWeights", linkageName: "\01?GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z", scope: !70, file: !70, line: 39, type: !71, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DIFile(filename: "Shaders/LanczosFunctions.hlsli", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!54, !26}
!73 = !DISubprogram(name: "ComputeWeights", linkageName: "\01?ComputeWeights@@YA?AV?$vector@M$03@@M@Z", scope: !70, file: !70, line: 29, type: !71, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubprogram(name: "Lanczos", linkageName: "\01?Lanczos@@YAMMM@Z", scope: !70, file: !70, line: 23, type: !75, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!26, !26, !26}
!77 = !DISubprogram(name: "Sinc", linkageName: "\01?Sinc@@YAMM@Z", scope: !70, file: !70, line: 15, type: !78, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!26, !26}
!80 = !DISubprogram(name: "LoadSamples", linkageName: "\01?LoadSamples@@YA?AV?$matrix@M$03$02@@V?$vector@H$01@@V?$vector@I$01@@@Z", scope: !1, file: !1, line: 26, type: !81, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubroutineType(types: !82)
!82 = !{!22, !14, !4}
!83 = !{!84, !86, !90, !95, !97, !99, !101, !103}
!84 = !DIGlobalVariable(name: "kSrcResolution", linkageName: "\01?kSrcResolution@CB0@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 23, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!86 = !DIGlobalVariable(name: "Source", linkageName: "\01?Source@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !47)
!90 = !DIGlobalVariable(name: "FilterWeights", scope: !69, file: !70, line: 44, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2048, align: 32, elements: !93)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!93 = !{!94}
!94 = !DISubrange(count: 16)
!95 = !DIGlobalVariable(name: "M_PI", scope: !74, file: !70, line: 25, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!97 = !DIGlobalVariable(name: "FilterWeights.0", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0", scope: !69, file: !70, line: 44, type: !98, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.0")
!98 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !91, size: 512, align: 4)
!99 = !DIGlobalVariable(name: "FilterWeights.1", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1", scope: !69, file: !70, line: 44, type: !100, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.1")
!100 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !91, size: 512, align: 4, offset: 512)
!101 = !DIGlobalVariable(name: "FilterWeights.2", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2", scope: !69, file: !70, line: 44, type: !102, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.2")
!102 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !91, size: 512, align: 4, offset: 1024)
!103 = !DIGlobalVariable(name: "FilterWeights.3", linkageName: "\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3", scope: !69, file: !70, line: 44, type: !104, isLocal: false, isDefinition: true, variable: [16 x float]* @"\01?FilterWeights@?1??GetUpscaleFilterWeights@@YA?AV?$vector@M$03@@M@Z@4QBV2@B.3")
!104 = !DIDerivedType(tag: DW_TAG_member, name: ".3", baseType: !91, size: 512, align: 4, offset: 1536)
!105 = !{i32 2, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!108 = !{!"Shaders\5CLanczosHorizontalPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//             Jack Elliott\0D\0A//\0D\0A\0D\0A#include \22LanczosFunctions.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A\0D\0ATexture2D<float3> Source : register(t0);\0D\0A\0D\0Acbuffer CB0 : register(b0)\0D\0A{\0D\0A    float2 kSrcResolution;\0D\0A};\0D\0A\0D\0Afloat4x3 LoadSamples(int2 ST, uint2 Stride)\0D\0A{\0D\0A    int2 st0 = ST, st1 = ST+Stride, st2 = ST+2*Stride, st3 = ST+3*Stride;\0D\0A    return float4x3(Source[st0], Source[st1], Source[st2], Source[st3]);\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main(float4 Pos : SV_Position, float2 UV : TexCoord0) : SV_Target0\0D\0A{\0D\0A    // We subtract 0.5 because that represents the center of the pixel.  We need to know where\0D\0A    // we lie between two pixel centers, and we will use frac() for that.  We subtract another\0D\0A    // 1.0 so that our start index is one pixel to the left.\0D\0A    float2 TopLeft = UV * kSrcResolution - 1.5;\0D\0A\0D\0A#ifdef LANCZOS_VERTICAL\0D\0A    float4 Weights = GetUpscaleFilterWeights(frac(TopLeft.y));\0D\0A    float4x3 Samples = LoadSamples(int2(floor(Pos.x), TopLeft.y), uint2(0, 1));\0D\0A#else\0D\0A    float4 Weights = GetUpscaleFilterWeights(frac(TopLeft.x));\0D\0A    float4x3 Samples = LoadSamples(int2(TopLeft.x, floor(Pos.y)), uint2(1, 0));\0D\0A#endif\0D\0A\0D\0A    float3 Result = mul(Weights, Samples);\0D\0A\0D\0A#ifdef LANCZOS_VERTICAL\0D\0A    // Transform to display settings\0D\0A    Result = RemoveDisplayProfile(Result, LDR_COLOR_FORMAT);\0D\0A    Result = ApplyDisplayProfile(Result, DISPLAY_PLANE_FORMAT);\0D\0A#endif\0D\0A\0D\0A    return Result;\0D\0A}\0D\0A"}
