#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2d66c63960cfefc6c6891eeb9194d6cd.pdb
; shader hash: 2d66c63960cfefc6c6891eeb9194d6cd
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140
;       float2 gBufferDim;                            ; Offset:  144
;       float2 gRcpBufferDim;                         ; Offset:  152
;       uint gBinsPerRow;                             ; Offset:  160
;       uint gTileRowPitch;                           ; Offset:  164
;       uint gTilesPerRow;                            ; Offset:  168
;       uint gTilesPerCol;                            ; Offset:  172
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !21, globals: !44)
!1 = !DIFile(filename: "Shaders\5CParticleTileCullingCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 96, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 96, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 96, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 123, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 123, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 123, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 123, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !{!22, !34, !37, !41}
!22 = !DISubprogram(name: "main", scope: !1, file: !1, line: 83, type: !23, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !33, !25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 41, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 41, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 41, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!11, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!34 = !DISubprogram(name: "BitonicSort", linkageName: "\01?BitonicSort@@YAXIIII@Z", scope: !1, file: !1, line: 43, type: !35, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !33, !33, !33, !33}
!37 = !DISubprogram(name: "InsertZeroBit", linkageName: "\01?InsertZeroBit@@YAIII@Z", scope: !38, file: !38, line: 71, type: !39, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!33, !33, !33}
!41 = !DISubprogram(name: "ComputeMaskOffset", linkageName: "\01?ComputeMaskOffset@@YAIV?$vector@I$01@@0@Z", scope: !1, file: !1, line: 73, type: !42, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!33, !4, !4}
!44 = !{!45, !71, !72, !74, !75, !76, !77, !85, !86, !88, !89, !90, !91, !95, !99, !103, !104, !105, !107, !108, !109, !112, !114, !116, !138, !140, !142, !143, !144}
!45 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !38, line: 34, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !49, templateParams: !67)
!49 = !{!50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !48, file: !1, line: 34, baseType: !51, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!68, !69, !70}
!68 = !DITemplateTypeParameter(name: "element", type: !51)
!69 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!70 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!71 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !38, line: 35, type: !46, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !38, line: 37, type: !73, isLocal: false, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!74 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !38, line: 38, type: !73, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !38, line: 39, type: !73, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !38, line: 40, type: !73, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !38, line: 42, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !81, templateParams: !84)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !1, line: 42, baseType: !51, size: 32, align: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !80, file: !1, line: 42, baseType: !51, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!84 = !{!68, !12}
!85 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !38, line: 43, type: !78, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !38, line: 45, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!88 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !38, line: 46, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !38, line: 47, type: !87, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !38, line: 48, type: !87, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "gs_SortKeys", linkageName: "\01?gs_SortKeys@@3PAIA", scope: !0, file: !1, line: 37, type: !92, isLocal: false, isDefinition: true, variable: [1024 x i32] addrspace(3)* @"\01?gs_SortKeys@@3PAIA")
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32768, align: 32, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1024)
!95 = !DIGlobalVariable(name: "gs_IntersectionMasks", linkageName: "\01?gs_IntersectionMasks@@3PAIA", scope: !0, file: !1, line: 38, type: !96, isLocal: false, isDefinition: true, variable: [64 x i32] addrspace(3)* @"\01?gs_IntersectionMasks@@3PAIA")
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, align: 32, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 64)
!99 = !DIGlobalVariable(name: "gs_TileParticleCounts", linkageName: "\01?gs_TileParticleCounts@@3PAIA", scope: !0, file: !1, line: 39, type: !100, isLocal: false, isDefinition: true, variable: [32 x i32] addrspace(3)* @"\01?gs_TileParticleCounts@@3PAIA")
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1024, align: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 32)
!103 = !DIGlobalVariable(name: "gs_SlowTileParticleCounts", linkageName: "\01?gs_SlowTileParticleCounts@@3PAIA", scope: !0, file: !1, line: 40, type: !100, isLocal: false, isDefinition: true, variable: [32 x i32] addrspace(3)* @"\01?gs_SlowTileParticleCounts@@3PAIA")
!104 = !DIGlobalVariable(name: "gs_MinMaxDepth", linkageName: "\01?gs_MinMaxDepth@@3PAIA", scope: !0, file: !1, line: 41, type: !100, isLocal: false, isDefinition: true, variable: [32 x i32] addrspace(3)* @"\01?gs_MinMaxDepth@@3PAIA")
!105 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !38, line: 28, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!107 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !38, line: 29, type: !106, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !38, line: 30, type: !106, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "g_BinParticles", linkageName: "\01?g_BinParticles@@3V?$StructuredBuffer@I@@A", scope: !0, file: !1, line: 17, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<unsigned int>", file: !1, line: 17, size: 32, align: 32, elements: !2, templateParams: !111)
!111 = !{!11}
!112 = !DIGlobalVariable(name: "g_BinCounters", linkageName: "\01?g_BinCounters@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 18, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 18, size: 32, align: 32, elements: !2)
!114 = !DIGlobalVariable(name: "g_DepthBounds", linkageName: "\01?g_DepthBounds@@3V?$Texture2D@I@@A", scope: !0, file: !1, line: 19, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<unsigned int>", file: !1, line: 19, size: 64, align: 32, elements: !2, templateParams: !111)
!116 = !DIGlobalVariable(name: "g_VisibleParticles", linkageName: "\01?g_VisibleParticles@@3V?$StructuredBuffer@UParticleScreenData@@@@A", scope: !0, file: !1, line: 20, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleScreenData>", file: !1, line: 20, size: 384, align: 32, elements: !2, templateParams: !118)
!118 = !{!119}
!119 = !DITemplateTypeParameter(name: "element", type: !120)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !38, line: 60, size: 384, align: 32, elements: !121)
!121 = !{!122, !123, !124, !134, !135, !136, !137}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !120, file: !38, line: 62, baseType: !79, size: 64, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !120, file: !38, line: 63, baseType: !79, size: 64, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !120, file: !38, line: 64, baseType: !125, size: 128, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !127, templateParams: !132)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !126, file: !1, line: 20, baseType: !51, size: 32, align: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !126, file: !1, line: 20, baseType: !51, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !126, file: !1, line: 20, baseType: !51, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !126, file: !1, line: 20, baseType: !51, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!132 = !{!68, !133}
!133 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !120, file: !38, line: 65, baseType: !51, size: 32, align: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !120, file: !38, line: 66, baseType: !51, size: 32, align: 32, offset: 288)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !120, file: !38, line: 67, baseType: !51, size: 32, align: 32, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !120, file: !38, line: 68, baseType: !33, size: 32, align: 32, offset: 352)
!138 = !DIGlobalVariable(name: "g_SortedParticles", linkageName: "\01?g_SortedParticles@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 22, type: !139, isLocal: false, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 22, size: 32, align: 32, elements: !2, templateParams: !111)
!140 = !DIGlobalVariable(name: "g_TileHitMasks", linkageName: "\01?g_TileHitMasks@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 23, type: !141, isLocal: false, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 23, size: 32, align: 32, elements: !2)
!142 = !DIGlobalVariable(name: "g_DrawPackets", linkageName: "\01?g_DrawPackets@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 24, type: !139, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariable(name: "g_FastDrawPackets", linkageName: "\01?g_FastDrawPackets@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 25, type: !139, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariable(name: "g_DrawPacketCount", linkageName: "\01?g_DrawPacketCount@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 26, type: !141, isLocal: false, isDefinition: true)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
