#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 74577405f35c2cab5d6ae7c47304aa47.pdb
; shader hash: 74577405f35c2cab5d6ae7c47304aa47
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140
;       float2 gBufferDim;                            ; Offset:  144
;       float2 gRcpBufferDim;                         ; Offset:  152
;       uint gBinsPerRow;                             ; Offset:  160
;       uint gTileRowPitch;                           ; Offset:  164
;       uint gTilesPerRow;                            ; Offset:  168
;       uint gTilesPerCol;                            ; Offset:  172
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !45)
!1 = !DIFile(filename: "Shaders\5CParticlePreSortCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 16, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 16, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 16, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25, !38, !41}
!25 = !DISubprogram(name: "main", scope: !1, file: !1, line: 60, type: !26, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !28, !37}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 21, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 21, size: 96, align: 32, elements: !30, templateParams: !35)
!30 = !{!31, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 21, baseType: !32, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 21, baseType: !32, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 21, baseType: !32, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!36, !23}
!36 = !DITemplateTypeParameter(name: "element", type: !32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !32)
!38 = !DISubprogram(name: "FillSortKey", linkageName: "\01?FillSortKey@@YAXIII@Z", scope: !1, file: !1, line: 23, type: !39, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !37, !37, !37}
!41 = !DISubprogram(name: "InsertZeroBit", linkageName: "\01?InsertZeroBit@@YAIII@Z", scope: !42, file: !42, line: 71, type: !43, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!37, !37, !37}
!45 = !{!46, !70, !71, !73, !74, !75, !76, !85, !86, !88, !89, !90, !91, !95, !97, !98, !99, !109, !111, !114}
!46 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !42, line: 34, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!70 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !42, line: 35, type: !47, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !42, line: 37, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!73 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !42, line: 38, type: !72, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !42, line: 39, type: !72, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !42, line: 40, type: !72, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !42, line: 42, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !80, templateParams: !83)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !79, file: !1, line: 42, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !79, file: !1, line: 42, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !{!13, !84}
!84 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!85 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !42, line: 43, type: !77, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !42, line: 45, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!88 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !42, line: 46, type: !87, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !42, line: 47, type: !87, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !42, line: 48, type: !87, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "gs_SortKeys", linkageName: "\01?gs_SortKeys@@3PAIA", scope: !0, file: !1, line: 21, type: !92, isLocal: false, isDefinition: true, variable: [2048 x i32] addrspace(3)* @"\01?gs_SortKeys@@3PAIA")
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 65536, align: 32, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 2048)
!95 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !42, line: 28, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!97 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !42, line: 29, type: !96, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !42, line: 30, type: !96, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "g_VertexBuffer", linkageName: "\01?g_VertexBuffer@@3V?$StructuredBuffer@UParticleVertex@@@@A", scope: !0, file: !1, line: 16, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleVertex>", file: !1, line: 16, size: 288, align: 32, elements: !2, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleVertex", file: !42, line: 51, size: 288, align: 32, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !103, file: !42, line: 53, baseType: !16, size: 96, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !103, file: !42, line: 54, baseType: !4, size: 128, align: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !103, file: !42, line: 55, baseType: !8, size: 32, align: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "TextureID", scope: !103, file: !42, line: 56, baseType: !37, size: 32, align: 32, offset: 256)
!109 = !DIGlobalVariable(name: "g_VertexCount", linkageName: "\01?g_VertexCount@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 17, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 17, size: 32, align: 32, elements: !2)
!111 = !DIGlobalVariable(name: "g_SortBuffer", linkageName: "\01?g_SortBuffer@@3V?$RWStructuredBuffer@I@@A", scope: !0, file: !1, line: 18, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<unsigned int>", file: !1, line: 18, size: 32, align: 32, elements: !2, templateParams: !113)
!113 = !{!36}
!114 = !DIGlobalVariable(name: "g_DrawIndirectArgs", linkageName: "\01?g_DrawIndirectArgs@@3URWByteAddressBuffer@@A", scope: !0, file: !1, line: 19, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 19, size: 32, align: 32, elements: !2)
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
