#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: de97cd6d8b4c22f10023b2a70b5b2b38.pdb
; shader hash: de97cd6d8b4c22f10023b2a70b5b2b38
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer EmissionProperties
; {
;
;   struct EmissionProperties
;   {
;
;       float3 LastEmitPosW;                          ; Offset:    0
;       float EmitSpeed;                              ; Offset:   12
;       float3 EmitPosW;                              ; Offset:   16
;       float FloorHeight;                            ; Offset:   28
;       float3 EmitDirW;                              ; Offset:   32
;       float Restitution;                            ; Offset:   44
;       float3 EmitRightW;                            ; Offset:   48
;       float EmitterVelocitySensitivity;             ; Offset:   60
;       float3 EmitUpW;                               ; Offset:   64
;       uint MaxParticles;                            ; Offset:   76
;       float3 Gravity;                               ; Offset:   80
;       uint TextureID;                               ; Offset:   92

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !18)
!1 = !DIFile(filename: "Shaders\5CParticleSpawnCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !5, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 48, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 48, size: 96, align: 32, elements: !9, templateParams: !14)
!9 = !{!10, !12, !13}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 48, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 48, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 48, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !11)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 3)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !{!19, !31, !33, !34, !35, !36, !37, !38, !39, !40, !43, !44, !45, !46, !47, !61, !86, !87, !88, !89, !90, !91, !100, !101, !102, !103, !104, !105, !107, !108, !109, !133}
!19 = !DIGlobalVariable(name: "LastEmitPosW", linkageName: "\01?LastEmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 17, type: !21, isLocal: false, isDefinition: true)
!20 = !DIFile(filename: "Shaders/ParticleUpdateCommon.hlsli", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 17, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 17, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 17, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !16}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIGlobalVariable(name: "EmitSpeed", linkageName: "\01?EmitSpeed@EmissionProperties@@3MB", scope: !0, file: !20, line: 18, type: !32, isLocal: false, isDefinition: true)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!33 = !DIGlobalVariable(name: "EmitPosW", linkageName: "\01?EmitPosW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 19, type: !21, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariable(name: "FloorHeight", linkageName: "\01?FloorHeight@EmissionProperties@@3MB", scope: !0, file: !20, line: 20, type: !32, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariable(name: "EmitDirW", linkageName: "\01?EmitDirW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 21, type: !21, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariable(name: "Restitution", linkageName: "\01?Restitution@EmissionProperties@@3MB", scope: !0, file: !20, line: 22, type: !32, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariable(name: "EmitRightW", linkageName: "\01?EmitRightW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 23, type: !21, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariable(name: "EmitterVelocitySensitivity", linkageName: "\01?EmitterVelocitySensitivity@EmissionProperties@@3MB", scope: !0, file: !20, line: 24, type: !32, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariable(name: "EmitUpW", linkageName: "\01?EmitUpW@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 25, type: !21, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariable(name: "MaxParticles", linkageName: "\01?MaxParticles@EmissionProperties@@3IB", scope: !0, file: !20, line: 26, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !11)
!43 = !DIGlobalVariable(name: "Gravity", linkageName: "\01?Gravity@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 27, type: !21, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariable(name: "TextureID", linkageName: "\01?TextureID@EmissionProperties@@3IB", scope: !0, file: !20, line: 28, type: !41, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariable(name: "EmissiveColor", linkageName: "\01?EmissiveColor@EmissionProperties@@3V?$vector@M$02@@B", scope: !0, file: !20, line: 29, type: !21, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariable(name: "pad", linkageName: "\01?pad@EmissionProperties@@3MB", scope: !0, file: !20, line: 30, type: !32, isLocal: false, isDefinition: true)
!47 = !DIGlobalVariable(name: "RandIndex", linkageName: "\01?RandIndex@EmissionProperties@@3QBV?$vector@I$03@@B", scope: !0, file: !20, line: 31, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8192, align: 32, elements: !59)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 31, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 31, size: 128, align: 32, elements: !52, templateParams: !57)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 31, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 31, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 31, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !51, file: !1, line: 31, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!57 = !{!15, !58}
!58 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!59 = !{!60}
!60 = !DISubrange(count: 64)
!61 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !62, line: 34, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !66, templateParams: !83)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !65, file: !1, line: 34, baseType: !26, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!83 = !{!30, !84, !85}
!84 = !DITemplateValueParameter(name: "row_count", type: !17, value: i32 4)
!85 = !DITemplateValueParameter(name: "col_count", type: !17, value: i32 4)
!86 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !62, line: 35, type: !63, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !62, line: 37, type: !32, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !62, line: 38, type: !32, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !62, line: 39, type: !32, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !62, line: 40, type: !32, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "gBufferDim", linkageName: "\01?gBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !62, line: 42, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !95, templateParams: !98)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !94, file: !1, line: 42, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !94, file: !1, line: 42, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !{!30, !99}
!99 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 2)
!100 = !DIGlobalVariable(name: "gRcpBufferDim", linkageName: "\01?gRcpBufferDim@CBChangesPerView@@3V?$vector@M$01@@B", scope: !0, file: !62, line: 43, type: !92, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "gBinsPerRow", linkageName: "\01?gBinsPerRow@CBChangesPerView@@3IB", scope: !0, file: !62, line: 45, type: !41, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "gTileRowPitch", linkageName: "\01?gTileRowPitch@CBChangesPerView@@3IB", scope: !0, file: !62, line: 46, type: !41, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "gTilesPerRow", linkageName: "\01?gTilesPerRow@CBChangesPerView@@3IB", scope: !0, file: !62, line: 47, type: !41, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "gTilesPerCol", linkageName: "\01?gTilesPerCol@CBChangesPerView@@3IB", scope: !0, file: !62, line: 48, type: !41, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "gSampLinearBorder", linkageName: "\01?gSampLinearBorder@@3USamplerState@@A", scope: !0, file: !62, line: 28, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!107 = !DIGlobalVariable(name: "gSampPointBorder", linkageName: "\01?gSampPointBorder@@3USamplerState@@A", scope: !0, file: !62, line: 29, type: !106, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "gSampPointClamp", linkageName: "\01?gSampPointClamp@@3USamplerState@@A", scope: !0, file: !62, line: 30, type: !106, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "g_ResetData", linkageName: "\01?g_ResetData@@3V?$StructuredBuffer@UParticleSpawnData@@@@A", scope: !0, file: !1, line: 18, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<ParticleSpawnData>", file: !1, line: 18, size: 640, align: 32, elements: !2, templateParams: !111)
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "element", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleSpawnData", file: !20, line: 34, size: 640, align: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !132}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "AgeRate", scope: !113, file: !20, line: 36, baseType: !26, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "RotationSpeed", scope: !113, file: !20, line: 37, baseType: !26, size: 32, align: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "StartSize", scope: !113, file: !20, line: 38, baseType: !26, size: 32, align: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "EndSize", scope: !113, file: !20, line: 39, baseType: !26, size: 32, align: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Velocity", scope: !113, file: !20, line: 40, baseType: !22, size: 96, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Mass", scope: !113, file: !20, line: 41, baseType: !26, size: 32, align: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "SpreadOffset", scope: !113, file: !20, line: 42, baseType: !22, size: 96, align: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Random", scope: !113, file: !20, line: 43, baseType: !26, size: 32, align: 32, offset: 352)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "StartColor", scope: !113, file: !20, line: 44, baseType: !124, size: 128, align: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 30, baseType: !125)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 30, size: 128, align: 32, elements: !126, templateParams: !131)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !125, file: !1, line: 30, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !125, file: !1, line: 30, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !125, file: !1, line: 30, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !125, file: !1, line: 30, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!131 = !{!30, !58}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "EndColor", scope: !113, file: !20, line: 45, baseType: !124, size: 128, align: 32, offset: 512)
!133 = !DIGlobalVariable(name: "g_OutputBuffer", linkageName: "\01?g_OutputBuffer@@3V?$RWStructuredBuffer@UParticleMotion@@@@A", scope: !0, file: !1, line: 19, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "RWStructuredBuffer<ParticleMotion>", file: !1, line: 19, size: 320, align: 32, elements: !2, templateParams: !135)
!135 = !{!136}
!136 = !DITemplateTypeParameter(name: "element", type: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleMotion", file: !20, line: 48, size: 320, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !137, file: !20, line: 50, baseType: !22, size: 96, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Mass", scope: !137, file: !20, line: 51, baseType: !26, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "Velocity", scope: !137, file: !20, line: 52, baseType: !22, size: 96, align: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Age", scope: !137, file: !20, line: 53, baseType: !26, size: 32, align: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Rotation", scope: !137, file: !20, line: 54, baseType: !26, size: 32, align: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ResetDataIndex", scope: !137, file: !20, line: 55, baseType: !42, size: 32, align: 32, offset: 288)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!148 = !{!"Shaders\5CParticleSpawnCS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  Julia Careaga\0D\0A//          James Stanard \0D\0A//\0D\0A\0D\0A#include \22ParticleUpdateCommon.hlsli\22\0D\0A#include \22ParticleUtility.hlsli\22\0D\0A\0D\0AStructuredBuffer< ParticleSpawnData > g_ResetData : register( t0 );\0D\0ARWStructuredBuffer< ParticleMotion > g_OutputBuffer : register( u2 );\0D\0A\0D\0A[RootSignature(Particle_RootSig)]\0D\0A[numthreads(64, 1, 1)]\0D\0Avoid main( uint3 DTid : SV_DispatchThreadID )\0D\0A{\0D\0A    uint index = g_OutputBuffer.IncrementCounter();\0D\0A    if (index >= MaxParticles)\0D\0A        return;\0D\0A    \0D\0A    uint ResetDataIndex = RandIndex[DTid.x].x; \0D\0A    ParticleSpawnData rd  = g_ResetData[ResetDataIndex];\0D\0A        \0D\0A    float3 emitterVelocity = EmitPosW - LastEmitPosW; \0D\0A    float3 randDir = rd.Velocity.x * EmitRightW + rd.Velocity.y * EmitUpW + rd.Velocity.z * EmitDirW;\0D\0A    float3 newVelocity = emitterVelocity * EmitterVelocitySensitivity + randDir;\0D\0A    float3 adjustedPosition = EmitPosW - emitterVelocity * rd.Random + rd.SpreadOffset;\0D\0A\0D\0A    ParticleMotion newParticle;\0D\0A    newParticle.Position = adjustedPosition;\0D\0A    newParticle.Rotation = 0.0;\0D\0A    newParticle.Velocity = newVelocity + EmitDirW * EmitSpeed; \0D\0A    newParticle.Mass = rd.Mass; \0D\0A    newParticle.Age = 0.0;\0D\0A    newParticle.ResetDataIndex = ResetDataIndex; \0D\0A    g_OutputBuffer[index] = newParticle;\0D\0A}\0D\0A"}
!149 = !{!"Shaders\5CParticleRS.hlsli", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define Particle_RootSig \5C\0D\0A    \22RootFlags(0), \22 \5C\0D\0A    \22RootConstants(b0, num32BitConstants = 3),\22 \5C\0D\0A    \22CBV(b1),\22 \5C\0D\0A    \22CBV(b2),\22 \5C\0D\0A    \22DescriptorTable(UAV(u0, numDescriptors = 8)),\22 \5C\0D\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10)),\22 \5C\0D\0A    \22StaticSampler(s0,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0D\0A    \22StaticSampler(s1,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_BORDER,\22 \5C\0D\0A        \22borderColor = STATIC_BORDER_COLOR_TRANSPARENT_BLACK,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_POINT), \22 \5C\0D\0A    \22StaticSampler(s2,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_MIP_POINT)\22\0D\0A"}
