#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 5fda6099a45a7360e35b12d3e0712674.pdb
; shader hash: 5fda6099a45a7360e35b12d3e0712674
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CBChangesPerView
; {
;
;   struct hostlayout.CBChangesPerView
;   {
;
;       column_major float4x4 gInvView;               ; Offset:    0
;       column_major float4x4 gViewProj;              ; Offset:   64
;       float gVertCotangent;                         ; Offset:  128
;       float gAspectRatio;                           ; Offset:  132
;       float gRcpFarZ;                               ; Offset:  136
;       float gInvertZ;                               ; Offset:  140
;       float2 gBufferDim;                            ; Offset:  144
;       float2 gRcpBufferDim;                         ; Offset:  152
;       uint gBinsPerRow;                             ; Offset:  160
;       uint gTileRowPitch;                           ; Offset:  164
;       uint gTilesPerRow;                            ; Offset:  168
;       uint gTilesPerCol;                            ; Offset:  172
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !30, globals: !113)
!1 = !DIFile(filename: "Shaders\5CParticleTileRenderCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 204, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 204, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 204, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 42, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 42, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 42, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 42, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 51, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 51, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 51, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 51, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!21, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!30 = !{!31, !42, !67, !91, !96, !100, !103, !106, !110}
!31 = !DISubprogram(name: "main", scope: !1, file: !1, line: 201, type: !32, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !41, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!11, !29}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 45, baseType: !8)
!42 = !DISubprogram(name: "RenderParticles", linkageName: "\01?RenderParticles@@YA?AV?$matrix@M$03$03@@V?$vector@I$01@@0III@Z", scope: !1, file: !1, line: 119, type: !43, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !4, !4, !41, !41, !41}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !47, templateParams: !64)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !46, file: !1, line: 34, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!64 = !{!21, !65, !66}
!65 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!66 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!67 = !DISubprogram(name: "BlendHighRes", linkageName: "\01?BlendHighRes@@YAXAIAV?$matrix@M$03$03@@UParticleScreenData@@V?$vector@M$01@@V?$vector@M$03@@@Z", scope: !1, file: !1, line: 64, type: !68, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !72, !14, !78}
!70 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !45)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleScreenData", file: !73, line: 60, size: 384, align: 32, elements: !74)
!73 = !DIFile(filename: "Shaders/ParticleUtility.hlsli", directory: "")
!74 = !{!75, !76, !77, !87, !88, !89, !90}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Corner", scope: !72, file: !73, line: 62, baseType: !14, size: 64, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "RcpSize", scope: !72, file: !73, line: 63, baseType: !14, size: 64, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !72, file: !73, line: 64, baseType: !78, size: 128, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !80, templateParams: !85)
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !79, file: !1, line: 35, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !79, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !79, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !79, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!85 = !{!21, !86}
!86 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !72, file: !73, line: 65, baseType: !18, size: 32, align: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !72, file: !73, line: 66, baseType: !18, size: 32, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "TextureLevel", scope: !72, file: !73, line: 67, baseType: !18, size: 32, align: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Bounds", scope: !72, file: !73, line: 68, baseType: !41, size: 32, align: 32, offset: 352)
!91 = !DISubprogram(name: "BlendPixel", linkageName: "\01?BlendPixel@@YAXAIAV?$vector@M$03@@V1@M@Z", scope: !1, file: !1, line: 59, type: !92, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !94, !78, !18}
!94 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !78)
!96 = !DISubprogram(name: "SampleParticleColor", linkageName: "\01?SampleParticleColor@@YA?AV?$vector@M$03@@UParticleScreenData@@USamplerState@@V?$vector@M$01@@M@Z", scope: !1, file: !1, line: 47, type: !97, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{!78, !72, !99, !14, !18}
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 28, size: 32, align: 32, elements: !2)
!100 = !DISubprogram(name: "WriteBlendedQuad", linkageName: "\01?WriteBlendedQuad@@YAXV?$vector@I$01@@V?$matrix@M$03$03@@@Z", scope: !1, file: !1, line: 111, type: !101, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !4, !45}
!103 = !DISubprogram(name: "WriteBlendedColor", linkageName: "\01?WriteBlendedColor@@YAXV?$vector@I$01@@V?$vector@M$03@@@Z", scope: !1, file: !1, line: 100, type: !104, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !4, !78}
!106 = !DISubprogram(name: "Unpack_R11G11B10_FLOAT", linkageName: "\01?Unpack_R11G11B10_FLOAT@@YA?AV?$vector@M$02@@I@Z", scope: !107, file: !107, line: 31, type: !108, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DIFile(filename: "Shaders/PixelPacking_R11G11B10.hlsli", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!22, !41}
!110 = !DISubprogram(name: "Pack_R11G11B10_FLOAT", linkageName: "\01?Pack_R11G11B10_FLOAT@@YAIV?$vector@M$02@@@Z", scope: !107, file: !107, line: 20, type: !111, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false)
!111 = !DISubroutineType(types: !112)
!112 = !{!41, !22}
!113 = !{!114, !116, !117, !119, !120, !121, !122, !124, !125, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !139, !143, !145, !149, !151, !154, !155, !157}
!114 = !DIGlobalVariable(name: "gInvView", linkageName: "\01?gInvView@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !73, line: 34, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!116 = !DIGlobalVariable(name: "gViewProj", linkageName: "\01?gViewProj@CBChangesPerView@@3V?$matrix@M$03$03@@B", scope: !0, file: !73, line: 35, type: !115, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "gVertCotangent", linkageName: "\01?gVertCotangent@CBChangesPerView@@3MB", scope: !0, file: !73, line: 37, type: !118, isLocal: false, isDefinition: true)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!119 = !DIGlobalVariable(name: "gAspectRatio", linkageName: "\01?gAspectRatio@CBChangesPerView@@3MB", scope: !0, file: !73, line: 38, type: !118, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "gRcpFarZ", linkageName: "\01?gRcpFarZ@CBChangesPerView@@3MB", scope: !0, file: !73, line: 39, type: !118, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "gInvertZ", linkageName: "\01?gInvertZ@CBChangesPerView@@3MB", scope: !0, file: !73, line: 40, type: !118, isLocal: false, isDefinition: true)
