#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: f70b6067a794fe6cf53c83fc19950ba8.pdb
; shader hash: f70b6067a794fe6cf53c83fc19950ba8
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer Constants
; {
;
;   struct Constants
;   {
;
;       float PaperWhiteRatio;                        ; Offset:    0
;       float MaxBrightness;                          ; Offset:    4
;       float2 UVOffset;                              ; Offset:    8
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !21, globals: !52)
!1 = !DIFile(filename: "Shaders\5CScaleAndCompositeHDRPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 49, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 49, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 26, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !{!22, !42, !46, !49, !50, !51}
!22 = !DISubprogram(name: "main", scope: !1, file: !1, line: 45, type: !23, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !33, !13}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 26, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 26, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 26, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!20, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !35, templateParams: !40)
!35 = !{!36, !37, !38, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 26, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !34, file: !1, line: 26, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !{!20, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!42 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 75, type: !44, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!25, !25}
!46 = !DISubprogram(name: "ScaleBuffer", linkageName: "\01?ScaleBuffer@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 34, type: !47, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubroutineType(types: !48)
!48 = !{!25, !13}
!49 = !DISubprogram(name: "SampleColor", linkageName: "\01?SampleColor@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 29, type: !47, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubprogram(name: "RemoveSRGBCurve", linkageName: "\01?RemoveSRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 43, type: !44, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 120, type: !44, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!52 = !{!53, !55, !56, !58, !62, !66, !68}
!53 = !DIGlobalVariable(name: "PaperWhiteRatio", linkageName: "\01?PaperWhiteRatio@Constants@@3MB", scope: !0, file: !1, line: 24, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!55 = !DIGlobalVariable(name: "MaxBrightness", linkageName: "\01?MaxBrightness@Constants@@3MB", scope: !0, file: !1, line: 25, type: !54, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "UVOffset", linkageName: "\01?UVOffset@Constants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 26, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!58 = !DIGlobalVariable(name: "MainBuffer", linkageName: "\01?MainBuffer@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !26)
!62 = !DIGlobalVariable(name: "OverlayBuffer", linkageName: "\01?OverlayBuffer@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 18, size: 160, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "element", type: !34)
!66 = !DIGlobalVariable(name: "BilinearFilter", linkageName: "\01?BilinearFilter@@3USamplerState@@A", scope: !0, file: !1, line: 20, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 20, size: 32, align: 32, elements: !2)
!68 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !51, file: !43, line: 122, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !72, templateParams: !82)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !71, file: !1, line: 122, baseType: !17, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!82 = !{!20, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!84 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!85 = !{i32 2, !"Dwarf Version", i32 4}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!88 = !{!"Shaders\5CScaleAndCompositeHDRPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#include \22ShaderUtility.hlsli\22\0D\0A#include \22PresentRS.hlsli\22\0D\0A\0D\0ATexture2D<float3> MainBuffer : register(t0);\0D\0ATexture2D<float4> OverlayBuffer : register(t1);\0D\0A\0D\0ASamplerState BilinearFilter : register(s0);\0D\0A\0D\0Acbuffer Constants : register(b0)\0D\0A{\0D\0A    float PaperWhiteRatio; // PaperWhite / 10000.0\0D\0A    float MaxBrightness;\0D\0A    float2 UVOffset;\0D\0A}\0D\0A\0D\0Afloat3 SampleColor(float2 uv)\0D\0A{\0D\0A    return MainBuffer.SampleLevel(BilinearFilter, uv, 0);\0D\0A}\0D\0A\0D\0Afloat3 ScaleBuffer(float2 uv)\0D\0A{\0D\0A    return 1.4 * SampleColor(uv) - 0.1 * (\0D\0A        SampleColor(uv + float2(+UVOffset.x, +UVOffset.y)) +\0D\0A        SampleColor(uv + float2(+UVOffset.x, -UVOffset.y)) +\0D\0A        SampleColor(uv + float2(-UVOffset.x, +UVOffset.y)) +\0D\0A        SampleColor(uv + float2(-UVOffset.x, -UVOffset.y))\0D\0A        );\0D\0A}\0D\0A\0D\0A[RootSignature(Present_RootSig)]\0D\0Afloat3 main( float4 position : SV_Position, float2 uv : TexCoord0 ) : SV_Target0\0D\0A{\0D\0A    float3 MainColor = ApplyREC2084Curve( saturate(ScaleBuffer(uv) / 10000.0) );\0D\0A\0D\0A    float4 OverlayColor = OverlayBuffer[(int2)position.xy];\0D\0A    OverlayColor.rgb = RemoveSRGBCurve(OverlayColor.rgb);\0D\0A    OverlayColor.rgb = REC709toREC2020(OverlayColor.rgb / (OverlayColor.a == 0.0 ? 1.0 : OverlayColor.a));\0D\0A    OverlayColor.rgb = ApplyREC2084Curve(OverlayColor.rgb * PaperWhiteRatio);\0D\0A\0D\0A    return lerp(MainColor, OverlayColor.rgb, OverlayColor.a);\0D\0A}\0D\0A"}
