#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: c42b65dc0bcd094943e7b63a8eecf2b8.pdb
; shader hash: c42b65dc0bcd094943e7b63a8eecf2b8
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer InlineConstants
; {
;
;   struct InlineConstants
;   {
;
;       float WA;                                     ; Offset:    0
;       float WB;                                     ; Offset:    4
;   
;   } InlineConstants;                                ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; InlineConstants                   cbuffer      NA          NA     CB0            cb0     1
; TemporalColor                     texture     f32          2d      T0             t0     1
; OutColor                              UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%dx.types.Handle = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !46)
!1 = !DIFile(filename: "Shaders\5CSharpenTAACS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !21}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 49, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 49, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 49, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 49, size: 64, align: 32, elements: !16, templateParams: !19)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 49, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 49, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !13)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 65, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 65, size: 96, align: 32, elements: !23, templateParams: !28)
!23 = !{!24, !26, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !22, file: !1, line: 65, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!25 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !22, file: !1, line: 65, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !22, file: !1, line: 65, baseType: !25, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!29, !30}
!29 = !DITemplateTypeParameter(name: "element", type: !25)
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !{!32, !43}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 47, type: !33, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !35, !35, !42}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 38, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 38, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!11, !30}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 38, baseType: !8)
!43 = !DISubprogram(name: "LoadSample", linkageName: "\01?LoadSample@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 40, type: !44, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!21, !42}
!46 = !{!47, !49, !50, !54, !55, !56, !57, !69, !73, !75}
!47 = !DIGlobalVariable(name: "WA", linkageName: "\01?WA@InlineConstants@@3MB", scope: !0, file: !1, line: 24, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!49 = !DIGlobalVariable(name: "WB", linkageName: "\01?WB@InlineConstants@@3MB", scope: !0, file: !1, line: 24, type: !48, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !1, line: 35, type: !51, isLocal: false, isDefinition: true, variable: [100 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 3200, align: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 100)
!54 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !1, line: 36, type: !51, isLocal: false, isDefinition: true, variable: [100 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!55 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !1, line: 37, type: !51, isLocal: false, isDefinition: true, variable: [100 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!56 = !DIGlobalVariable(name: "gs_W", linkageName: "\01?gs_W@@3PAMA", scope: !0, file: !1, line: 38, type: !51, isLocal: false, isDefinition: true, variable: [100 x float] addrspace(3)* @"\01?gs_W@@3PAMA")
!57 = !DIGlobalVariable(name: "TemporalColor", linkageName: "\01?TemporalColor@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 16, size: 160, align: 32, elements: !2, templateParams: !59)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "element", type: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 53, size: 128, align: 32, elements: !62, templateParams: !67)
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !61, file: !1, line: 53, baseType: !25, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !61, file: !1, line: 53, baseType: !25, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !61, file: !1, line: 53, baseType: !25, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !61, file: !1, line: 53, baseType: !25, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!67 = !{!29, !68}
!68 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!69 = !DIGlobalVariable(name: "OutColor", linkageName: "\01?OutColor@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 17, size: 96, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "element", type: !22)
!73 = !DIGlobalVariable(name: "LinearSampler", linkageName: "\01?LinearSampler@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "PointSampler", linkageName: "\01?PointSampler@@3USamplerState@@A", scope: !0, file: !1, line: 20, type: !74, isLocal: false, isDefinition: true)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
