#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TexCoord                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyz         0   TARGET   float   xyz 
;
; shader debug name: 396f7ef1736857d2663a9afeed14ce50.pdb
; shader hash: 396f7ef1736857d2663a9afeed14ce50
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TexCoord                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer Constants
; {
;
;   struct Constants
;   {
;
;       float2 UVOffset0;                             ; Offset:    0
;       float2 UVOffset1;                             ; Offset:    8
;       float WA;                                     ; Offset:   16

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !50)
!1 = !DIFile(filename: "Shaders\5CSharpeningUpsampleGammaPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !35, !38, !42, !46, !47, !48, !49}
!4 = !DISubprogram(name: "main", scope: !5, file: !5, line: 40, type: !6, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DIFile(filename: "Shaders/SharpeningUpsamplePS.hlsl", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !19, !28}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 26, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 26, size: 96, align: 32, elements: !10, templateParams: !15)
!10 = !{!11, !13, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !9, file: !1, line: 26, baseType: !12, size: 32, align: 32, flags: DIFlagPublic)
!12 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !9, file: !1, line: 26, baseType: !12, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !9, file: !1, line: 26, baseType: !12, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !12)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !21, templateParams: !26)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !1, line: 26, baseType: !12, size: 32, align: 32, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !1, line: 26, baseType: !12, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !1, line: 26, baseType: !12, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !20, file: !1, line: 26, baseType: !12, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!26 = !{!16, !27}
!27 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 24, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 24, size: 64, align: 32, elements: !30, templateParams: !33)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 24, baseType: !12, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 24, baseType: !12, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !{!16, !34}
!34 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!35 = !DISubprogram(name: "GetColor", linkageName: "\01?GetColor@@YA?AV?$vector@M$02@@V?$vector@M$01@@@Z", scope: !5, file: !5, line: 29, type: !36, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!8, !28}
!38 = !DISubprogram(name: "ApplyDisplayProfile", linkageName: "\01?ApplyDisplayProfile@@YA?AV?$vector@M$02@@V1@H@Z", scope: !39, file: !39, line: 94, type: !40, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DIFile(filename: "Shaders/ShaderUtility.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!8, !8, !18}
!42 = !DISubprogram(name: "ApplySRGBCurve", linkageName: "\01?ApplySRGBCurve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 37, type: !44, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DIFile(filename: "Shaders/ColorSpaceUtility.hlsli", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!8, !8}
!46 = !DISubprogram(name: "RGBFullToLimited10bit", linkageName: "\01?RGBFullToLimited10bit@@YA?AV?$vector@M$02@@V1@@Z", scope: !39, file: !39, line: 71, type: !44, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DISubprogram(name: "ApplyREC709Curve", linkageName: "\01?ApplyREC709Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 63, type: !44, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubprogram(name: "ApplyREC2084Curve", linkageName: "\01?ApplyREC2084Curve@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 75, type: !44, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubprogram(name: "REC709toREC2020", linkageName: "\01?REC709toREC2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !43, file: !43, line: 120, type: !44, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false)
!50 = !{!51, !53, !54, !56, !57, !61, !63}
!51 = !DIGlobalVariable(name: "UVOffset0", linkageName: "\01?UVOffset0@Constants@@3V?$vector@M$01@@B", scope: !0, file: !5, line: 24, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!53 = !DIGlobalVariable(name: "UVOffset1", linkageName: "\01?UVOffset1@Constants@@3V?$vector@M$01@@B", scope: !0, file: !5, line: 25, type: !52, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariable(name: "WA", linkageName: "\01?WA@Constants@@3MB", scope: !0, file: !5, line: 26, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!56 = !DIGlobalVariable(name: "WB", linkageName: "\01?WB@Constants@@3MB", scope: !0, file: !5, line: 26, type: !55, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariable(name: "ColorTex", linkageName: "\01?ColorTex@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !5, line: 19, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 19, size: 128, align: 32, elements: !2, templateParams: !59)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "element", type: !9)
!61 = !DIGlobalVariable(name: "BilinearClamp", linkageName: "\01?BilinearClamp@@3USamplerState@@A", scope: !0, file: !5, line: 20, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 20, size: 32, align: 32, elements: !2)
!63 = !DIGlobalVariable(name: "ConvMat", linkageName: "\01?ConvMat@?1??REC709toREC2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !49, file: !43, line: 122, type: !64, isLocal: false, isDefinition: true)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 122, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 122, size: 288, align: 32, elements: !67, templateParams: !77)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !66, file: !1, line: 122, baseType: !12, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!77 = !{!16, !78, !79}
!78 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 3)
!79 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 3)
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!83 = !{!"Shaders\5CSharpeningUpsampleGammaPS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#define GAMMA_SPACE\0D\0A#include \22SharpeningUpsamplePS.hlsl\22\0D\0A"}
