#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; BLENDINDICES             0   xyzw        2     NONE    uint   xyzw
; BLENDWEIGHT              0   xyzw        3     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: 888853fc152c8236d70c53b7703d30b0.pdb
; shader hash: 888853fc152c8236d70c53b7703d30b0
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; BLENDINDICES             0                              
; BLENDWEIGHT              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !56)
!1 = !DIFile(filename: "Shaders\5CCutoutDepthSkinVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 28, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 28, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 62, type: !19, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "Shaders/DepthOnlyVS.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !32}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !18, line: 53, size: 192, align: 32, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !21, file: !18, line: 55, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !21, file: !18, line: 57, baseType: !25, size: 64, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 28, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 28, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !18, line: 41, size: 416, align: 32, elements: !33)
!33 = !{!34, !43, !44, !55}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !18, line: 43, baseType: !35, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 28, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 28, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !32, file: !18, line: 45, baseType: !25, size: 64, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "jointIndices", scope: !32, file: !18, line: 48, baseType: !45, size: 128, align: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 28, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 28, size: 128, align: 32, elements: !47, templateParams: !53)
!47 = !{!48, !50, !51, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 28, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 28, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !46, file: !1, line: 28, baseType: !49, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !46, file: !1, line: 28, baseType: !49, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !{!54, !14}
!54 = !DITemplateTypeParameter(name: "element", type: !49)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "jointWeights", scope: !32, file: !18, line: 49, baseType: !4, size: 128, align: 32, offset: 288)
!56 = !{!57, !81, !98, !99, !102, !104, !105}
!57 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 22, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !61, templateParams: !78)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !60, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!78 = !{!13, !79, !80}
!79 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!80 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!81 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !18, line: 23, type: !82, isLocal: false, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !85, templateParams: !95)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !84, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!95 = !{!13, !96, !97}
!96 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!97 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!98 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 28, type: !58, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !100, line: 41, type: !101, isLocal: false, isDefinition: true)
!100 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!102 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !100, line: 42, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!104 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !100, line: 43, type: !101, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "Joints", linkageName: "\01?Joints@@3V?$StructuredBuffer@UJoint@@@@A", scope: !0, file: !18, line: 38, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Joint>", file: !1, line: 38, size: 896, align: 32, elements: !2, templateParams: !107)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "element", type: !109)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Joint", file: !18, line: 32, size: 896, align: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "PosMatrix", scope: !109, file: !18, line: 34, baseType: !59, size: 512, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "NrmMatrix", scope: !109, file: !18, line: 35, baseType: !113, size: 384, align: 32, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 38, baseType: !114)
!114 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 38, size: 384, align: 32, elements: !115, templateParams: !128)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !114, file: !1, line: 38, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!128 = !{!13, !79, !97}
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!132 = !{!"Shaders\5CCutoutDepthSkinVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#define ENABLE_SKINNING\0D\0A#include \22CutoutDepthVS.hlsl\22"}
!133 = !{!"Shaders\5CCommon.hlsli", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#ifndef __COMMON_HLSLI__\0D\0A#define __COMMON_HLSLI__\0D\0A\0D\0A// outdated warning about for-loop variable scope\0D\0A#pragma warning (disable: 3078)\0D\0A// single-iteration loop\0D\0A#pragma warning (disable: 3557)\0D\0A\0D\0A#define Renderer_RootSig \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22DescriptorTable(Sampler(s0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22DescriptorTable(SRV(t10, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22CBV(b1), \22 \5C\0D\0A    \22SRV(t20, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A    \22StaticSampler(s10, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22StaticSampler(s11, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22comparisonFunc = COMPARISON_GREATER_EQUAL,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0D\0A    \22StaticSampler(s12, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL)\22\0D\0A\0D\0A// Common (static) samplers\0D\0ASamplerState defaultSampler : register(s10);\0D\0ASamplerComparisonState shadowSampler : register(s11);\0D\0ASamplerState cubeMapSampler : register(s12);\0D\0A\0D\0A#ifndef ENABLE_TRIANGLE_ID\0D\0A    #define ENABLE_TRIANGLE_ID 0\0D\0A#endif\0D\0A\0D\0A#if ENABLE_TRIANGLE_ID\0D\0A\0D\0Auint HashTriangleID(uint vertexID)\0D\0A{\0D\0A\09// TBD SM6.1 stuff\0D\0A\09uint Index0 = EvaluateAttributeAtVertex(vertexID, 0);\0D\0A\09uint Index1 = EvaluateAttributeAtVertex(vertexID, 1);\0D\0A\09uint Index2 = EvaluateAttributeAtVertex(vertexID, 2);\0D\0A\0D\0A\09// When triangles are clipped (to the near plane?) their interpolants can sometimes\0D\0A\09// be reordered.  To stabilize the ID generation, we need to sort the indices before\0D\0A\09// forming the hash.\0D\0A\09uint I0 = __XB_Min3_U32(Index0, Index1, Index2);\0D\0A\09uint I1 = __XB_Med3_U32(Index0, Index1, Index2);\0D\0A\09uint I2 = __XB_Max3_U32(Index0, Index1, Index2);\0D\0A\09return (I2 & 0xFF) << 16 | (I1 & 0xFF) << 8 | (I0 & 0xFF0000FF);\0D\0A}\0D\0A\0D\0A#endif // ENABLE_TRIANGLE_ID\0D\0A\0D\0A#endif // __COMMON_HLSLI__\0D\0A"}
