#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TANGENT                  0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1     zw        3     NONE   float     zw
; TEXCOORD                 2   xyz         4     NONE   float   xyz 
; TEXCOORD                 3   xyz         5     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 8228fedb4659ded0f28520569beb1277.pdb
; shader hash: 8228fedb4659ded0f28520569beb1277
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; NORMAL                   0                 linear       
; TANGENT                  0                 linear       
; TEXCOORD                 0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !93)
!1 = !DIFile(filename: "Shaders\5CDefaultPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !25, !40}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 281, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 281, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 281, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 281, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 35, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 35, size: 128, align: 32, elements: !16, templateParams: !22)
!16 = !{!17, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !15, file: !1, line: 35, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !18)
!24 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 229, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 229, size: 288, align: 32, elements: !27, templateParams: !37)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !26, file: !1, line: 229, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!37 = !{!23, !38, !39}
!38 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!39 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 36, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 36, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 36, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 36, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 36, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!23, !47}
!47 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!48 = !{!49, !67, !70, !83, !86, !89, !90}
!49 = !DISubprogram(name: "main", scope: !1, file: !1, line: 243, type: !50, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!50 = !DISubroutineType(types: !51)
!51 = !{!14, !52}
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 54, size: 672, align: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !64, !65, !66}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !52, file: !1, line: 56, baseType: !14, size: 128, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !52, file: !1, line: 57, baseType: !40, size: 96, align: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !52, file: !1, line: 59, baseType: !14, size: 128, align: 32, offset: 224)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !52, file: !1, line: 61, baseType: !58, size: 64, align: 32, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 38, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 38, size: 64, align: 32, elements: !60, templateParams: !63)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !59, file: !1, line: 38, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !59, file: !1, line: 38, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!63 = !{!23, !12}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "uv1", scope: !52, file: !1, line: 63, baseType: !58, size: 64, align: 32, offset: 416)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !52, file: !1, line: 65, baseType: !40, size: 96, align: 32, offset: 480)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sunShadowCoord", scope: !52, file: !1, line: 66, baseType: !40, size: 96, align: 32, offset: 576)
!67 = !DISubprogram(name: "ComputeNormal", linkageName: "\01?ComputeNormal@@YA?AV?$vector@M$02@@UVSOutput@@@Z", scope: !1, file: !1, line: 219, type: !68, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!40, !52}
!70 = !DISubprogram(name: "Diffuse_IBL", linkageName: "\01?Diffuse_IBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !1, file: !1, line: 198, type: !71, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!40, !73}
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceProperties", file: !1, line: 85, size: 512, align: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !73, file: !1, line: 87, baseType: !40, size: 96, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "V", scope: !73, file: !1, line: 88, baseType: !40, size: 96, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "c_diff", scope: !73, file: !1, line: 89, baseType: !40, size: 96, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "c_spec", scope: !73, file: !1, line: 90, baseType: !40, size: 96, align: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !73, file: !1, line: 91, baseType: !18, size: 32, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !73, file: !1, line: 92, baseType: !18, size: 32, align: 32, offset: 416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "alphaSqr", scope: !73, file: !1, line: 93, baseType: !18, size: 32, align: 32, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "NdotV", scope: !73, file: !1, line: 94, baseType: !18, size: 32, align: 32, offset: 480)
!83 = !DISubprogram(name: "Fresnel_Shlick", linkageName: "\01?Fresnel_Shlick@@YAMMMM@Z", scope: !1, file: !1, line: 121, type: !84, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!18, !18, !18, !18}
!86 = !DISubprogram(name: "Pow5", linkageName: "\01?Pow5@@YAMM@Z", scope: !1, file: !1, line: 109, type: !87, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!18, !18}
!89 = !DISubprogram(name: "Specular_IBL", linkageName: "\01?Specular_IBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !1, file: !1, line: 212, type: !71, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubprogram(name: "Fresnel_Shlick", linkageName: "\01?Fresnel_Shlick@@YA?AV?$vector@M$02@@V1@0M@Z", scope: !1, file: !1, line: 116, type: !91, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!40, !40, !40, !18}
!93 = !{!94, !96, !98, !100, !102, !105, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !143, !145, !146, !150, !154, !163, !164, !165, !166, !167, !168, !169, !170, !172, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !186, !188}
!94 = !DIGlobalVariable(name: "baseColorFactor", linkageName: "\01?baseColorFactor@MaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 35, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!96 = !DIGlobalVariable(name: "emissiveFactor", linkageName: "\01?emissiveFactor@MaterialConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 36, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!98 = !DIGlobalVariable(name: "normalTextureScale", linkageName: "\01?normalTextureScale@MaterialConstants@@3MB", scope: !0, file: !1, line: 37, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!100 = !DIGlobalVariable(name: "metallicRoughnessFactor", linkageName: "\01?metallicRoughnessFactor@MaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 38, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!102 = !DIGlobalVariable(name: "flags", linkageName: "\01?flags@MaterialConstants@@3IB", scope: !0, file: !1, line: 39, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 39, baseType: !8)
!105 = !DIGlobalVariable(name: "ViewProj", linkageName: "\01?ViewProj@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 44, type: !106, isLocal: false, isDefinition: true)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 44, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 44, size: 512, align: 32, elements: !109, templateParams: !126)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !108, file: !1, line: 44, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!126 = !{!23, !127, !128}
!127 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!128 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!129 = !DIGlobalVariable(name: "SunShadowMatrix", linkageName: "\01?SunShadowMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 45, type: !106, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 46, type: !97, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 47, type: !97, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "SunIntensity", linkageName: "\01?SunIntensity@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 48, type: !97, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "_pad", linkageName: "\01?_pad@GlobalConstants@@3MB", scope: !0, file: !1, line: 49, type: !99, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "IBLRange", linkageName: "\01?IBLRange@GlobalConstants@@3MB", scope: !0, file: !1, line: 50, type: !99, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariable(name: "IBLBias", linkageName: "\01?IBLBias@GlobalConstants@@3MB", scope: !0, file: !1, line: 51, type: !99, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariable(name: "BASECOLOR", scope: !0, file: !1, line: 74, type: !103, isLocal: true, isDefinition: true, variable: i32 0)
!137 = !DIGlobalVariable(name: "METALLICROUGHNESS", scope: !0, file: !1, line: 75, type: !103, isLocal: true, isDefinition: true, variable: i32 1)
!138 = !DIGlobalVariable(name: "OCCLUSION", scope: !0, file: !1, line: 76, type: !103, isLocal: true, isDefinition: true, variable: i32 2)
!139 = !DIGlobalVariable(name: "EMISSIVE", scope: !0, file: !1, line: 77, type: !103, isLocal: true, isDefinition: true, variable: i32 3)
!140 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !141, line: 41, type: !142, isLocal: false, isDefinition: true)
!141 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!143 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !141, line: 42, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!145 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !141, line: 43, type: !142, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariable(name: "baseColorTexture", linkageName: "\01?baseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 16, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 16, size: 160, align: 32, elements: !2, templateParams: !148)
!148 = !{!149}
!149 = !DITemplateTypeParameter(name: "element", type: !15)
!150 = !DIGlobalVariable(name: "metallicRoughnessTexture", linkageName: "\01?metallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 17, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 3> >", file: !1, line: 17, size: 128, align: 32, elements: !2, templateParams: !152)
!152 = !{!153}
!153 = !DITemplateTypeParameter(name: "element", type: !41)
!154 = !DIGlobalVariable(name: "occlusionTexture", linkageName: "\01?occlusionTexture@@3V?$Texture2D@V?$vector@M$00@@@@A", scope: !0, file: !1, line: 18, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 1> >", file: !1, line: 18, size: 64, align: 32, elements: !2, templateParams: !156)
!156 = !{!157}
!157 = !DITemplateTypeParameter(name: "element", type: !158)
!158 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 1>", file: !1, line: 18, size: 32, align: 32, elements: !159, templateParams: !161)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !158, file: !1, line: 18, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!161 = !{!23, !162}
!162 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 1)
!163 = !DIGlobalVariable(name: "emissiveTexture", linkageName: "\01?emissiveTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 19, type: !151, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "normalTexture", linkageName: "\01?normalTexture@@3V?$Texture2D@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 20, type: !151, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "baseColorSampler", linkageName: "\01?baseColorSampler@@3USamplerState@@A", scope: !0, file: !1, line: 22, type: !142, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "metallicRoughnessSampler", linkageName: "\01?metallicRoughnessSampler@@3USamplerState@@A", scope: !0, file: !1, line: 23, type: !142, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "occlusionSampler", linkageName: "\01?occlusionSampler@@3USamplerState@@A", scope: !0, file: !1, line: 24, type: !142, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "emissiveSampler", linkageName: "\01?emissiveSampler@@3USamplerState@@A", scope: !0, file: !1, line: 25, type: !142, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "normalSampler", linkageName: "\01?normalSampler@@3USamplerState@@A", scope: !0, file: !1, line: 26, type: !142, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "radianceIBLTexture", linkageName: "\01?radianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 28, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 3> >", file: !1, line: 28, size: 96, align: 32, elements: !2, templateParams: !152)
!172 = !DIGlobalVariable(name: "irradianceIBLTexture", linkageName: "\01?irradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 29, type: !171, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "texSSAO", linkageName: "\01?texSSAO@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 30, type: !174, isLocal: false, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 30, size: 64, align: 32, elements: !2, templateParams: !175)
!175 = !{!23}
!176 = !DIGlobalVariable(name: "texSunShadow", linkageName: "\01?texSunShadow@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 31, type: !174, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 70, type: !99, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariable(name: "kDielectricSpecular", scope: !0, file: !1, line: 71, type: !97, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariable(name: "BASECOLOR", scope: !0, file: !1, line: 74, type: !103, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariable(name: "METALLICROUGHNESS", scope: !0, file: !1, line: 75, type: !103, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariable(name: "OCCLUSION", scope: !0, file: !1, line: 76, type: !103, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariable(name: "EMISSIVE", scope: !0, file: !1, line: 77, type: !103, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariable(name: "NORMAL", scope: !0, file: !1, line: 78, type: !103, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariable(name: "kDielectricSpecular.2", linkageName: "kDielectricSpecular.2", scope: !0, file: !1, line: 71, type: !185, isLocal: false, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !97, size: 32, align: 4, offset: 64)
!186 = !DIGlobalVariable(name: "kDielectricSpecular.1", linkageName: "kDielectricSpecular.1", scope: !0, file: !1, line: 71, type: !187, isLocal: false, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !97, size: 32, align: 4, offset: 32)
!188 = !DIGlobalVariable(name: "kDielectricSpecular.0", linkageName: "kDielectricSpecular.0", scope: !0, file: !1, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !97, size: 32, align: 4)
!190 = !{i32 2, !"Dwarf Version", i32 4}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
