#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; BLENDINDICES             0   xyzw        3     NONE    uint   xyzw
; BLENDWEIGHT              0   xyzw        4     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 2   xyz         3     NONE   float   xyz 
; TEXCOORD                 3   xyz         4     NONE   float   xyz 
;
; shader debug name: 00eb592226de1d0c93a9f3d353095716.pdb
; shader hash: 00eb592226de1d0c93a9f3d353095716
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !60)
!1 = !DIFile(filename: "Shaders\5CDefaultNoTangentNoUV1SkinVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 32, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 32, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !18, file: !18, line: 78, type: !19, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DIFile(filename: "Shaders/DefaultVS.hlsl", directory: "")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !43}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !18, line: 62, size: 480, align: 32, elements: !22)
!22 = !{!23, !24, !33, !41, !42}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !21, file: !18, line: 64, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !21, file: !18, line: 65, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 30, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 30, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !21, file: !18, line: 69, baseType: !34, size: 64, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 32, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 32, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !21, file: !18, line: 73, baseType: !25, size: 96, align: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sunShadowCoord", scope: !21, file: !18, line: 74, baseType: !25, size: 96, align: 32, offset: 384)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !18, line: 45, size: 512, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !59}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !18, line: 47, baseType: !25, size: 96, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !43, file: !18, line: 48, baseType: !25, size: 96, align: 32, offset: 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "uv0", scope: !43, file: !18, line: 52, baseType: !34, size: 64, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "jointIndices", scope: !43, file: !18, line: 57, baseType: !49, size: 128, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 32, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 32, size: 128, align: 32, elements: !51, templateParams: !57)
!51 = !{!52, !54, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 32, baseType: !53, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 32, baseType: !53, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !1, line: 32, baseType: !53, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !50, file: !1, line: 32, baseType: !53, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!57 = !{!58, !14}
!58 = !DITemplateTypeParameter(name: "element", type: !53)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "jointWeights", scope: !43, file: !18, line: 58, baseType: !4, size: 128, align: 32, offset: 384)
!60 = !{!61, !85, !102, !103, !104, !106, !107, !108, !111, !113, !114}
!61 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 22, type: !62, isLocal: false, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !65, templateParams: !82)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !64, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!82 = !{!13, !83, !84}
!83 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!84 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!85 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !18, line: 23, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !89, templateParams: !99)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !88, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!99 = !{!13, !100, !101}
!100 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!101 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!102 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 28, type: !62, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "SunShadowMatrix", linkageName: "\01?SunShadowMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !18, line: 29, type: !62, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 30, type: !105, isLocal: false, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!106 = !DIGlobalVariable(name: "SunDirection", linkageName: "\01?SunDirection@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 31, type: !105, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "SunIntensity", linkageName: "\01?SunIntensity@GlobalConstants@@3V?$vector@M$02@@B", scope: !0, file: !18, line: 32, type: !105, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !109, line: 41, type: !110, isLocal: false, isDefinition: true)
!109 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!111 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !109, line: 42, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!113 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !109, line: 43, type: !110, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "Joints", linkageName: "\01?Joints@@3V?$StructuredBuffer@UJoint@@@@A", scope: !0, file: !18, line: 42, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Joint>", file: !1, line: 42, size: 896, align: 32, elements: !2, templateParams: !116)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "element", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Joint", file: !18, line: 36, size: 896, align: 32, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "PosMatrix", scope: !118, file: !18, line: 38, baseType: !63, size: 512, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "NrmMatrix", scope: !118, file: !18, line: 39, baseType: !122, size: 384, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x3", file: !1, line: 100, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 3>", file: !1, line: 100, size: 384, align: 32, elements: !124, templateParams: !137)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !123, file: !1, line: 100, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!137 = !{!13, !83, !101}
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!141 = !{!"Shaders\5CDefaultNoTangentNoUV1SkinVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#define ENABLE_SKINNING\0D\0A#include \22DefaultNoTangentNoUV1VS.hlsl\22"}
!142 = !{!"Shaders\5CCommon.hlsli", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author:  James Stanard \0D\0A//\0D\0A\0D\0A#ifndef __COMMON_HLSLI__\0D\0A#define __COMMON_HLSLI__\0D\0A\0D\0A// outdated warning about for-loop variable scope\0D\0A#pragma warning (disable: 3078)\0D\0A// single-iteration loop\0D\0A#pragma warning (disable: 3557)\0D\0A\0D\0A#define Renderer_RootSig \5C\0D\0A    \22RootFlags(ALLOW_INPUT_ASSEMBLER_INPUT_LAYOUT), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A    \22CBV(b0, visibility = SHADER_VISIBILITY_PIXEL), \22 \5C\0D\0A    \22DescriptorTable(SRV(t0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22DescriptorTable(Sampler(s0, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22DescriptorTable(SRV(t10, numDescriptors = 10), visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22CBV(b1), \22 \5C\0D\0A    \22SRV(t20, visibility = SHADER_VISIBILITY_VERTEX), \22 \5C\0D\0A    \22StaticSampler(s10, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL),\22 \5C\0D\0A    \22StaticSampler(s11, visibility = SHADER_VISIBILITY_PIXEL,\22 \5C\0D\0A        \22addressU = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressV = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22addressW = TEXTURE_ADDRESS_CLAMP,\22 \5C\0D\0A        \22comparisonFunc = COMPARISON_GREATER_EQUAL,\22 \5C\0D\0A        \22filter = FILTER_MIN_MAG_LINEAR_MIP_POINT),\22 \5C\0D\0A    \22StaticSampler(s12, maxAnisotropy = 8, visibility = SHADER_VISIBILITY_PIXEL)\22\0D\0A\0D\0A// Common (static) samplers\0D\0ASamplerState defaultSampler : register(s10);\0D\0ASamplerComparisonState shadowSampler : register(s11);\0D\0ASamplerState cubeMapSampler : register(s12);\0D\0A\0D\0A#ifndef ENABLE_TRIANGLE_ID\0D\0A    #define ENABLE_TRIANGLE_ID 0\0D\0A#endif\0D\0A\0D\0A#if ENABLE_TRIANGLE_ID\0D\0A\0D\0Auint HashTriangleID(uint vertexID)\0D\0A{\0D\0A\09// TBD SM6.1 stuff\0D\0A\09uint Index0 = EvaluateAttributeAtVertex(vertexID, 0);\0D\0A\09uint Index1 = EvaluateAttributeAtVertex(vertexID, 1);\0D\0A\09uint Index2 = EvaluateAttributeAtVertex(vertexID, 2);\0D\0A\0D\0A\09// When triangles are clipped (to the near plane?) their interpolants can sometimes\0D\0A\09// be reordered.  To stabilize the ID generation, we need to sort the indices before\0D\0A\09// forming the hash.\0D\0A\09uint I0 = __XB_Min3_U32(Index0, Index1, Index2);\0D\0A\09uint I1 = __XB_Med3_U32(Index0, Index1, Index2);\0D\0A\09uint I2 = __XB_Max3_U32(Index0, Index1, Index2);\0D\0A\09return (I2 & 0xFF) << 16 | (I1 & 0xFF) << 8 | (I0 & 0xFF0000FF);\0D\0A}\0D\0A\0D\0A#endif // ENABLE_TRIANGLE_ID\0D\0A\0D\0A#endif // __COMMON_HLSLI__\0D\0A"}
