#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
;
; shader debug name: c6dfcd82aeee34e22fbedeba7ba9e752.pdb
; shader hash: c6dfcd82aeee34e22fbedeba7ba9e752
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
;
; Buffer Definitions:
;
; cbuffer MeshConstants
; {
;
;   struct hostlayout.MeshConstants
;   {
;
;       column_major float4x4 WorldMatrix;            ; Offset:    0
;       column_major float3x3 WorldIT;                ; Offset:   64
;   
;   } MeshConstants;                                  ; Offset:    0 Size:   108
;
; }
;
; cbuffer GlobalConstants
; {
;
;   struct hostlayout.GlobalConstants
;   {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !34)
!1 = !DIFile(filename: "Shaders\5CDepthOnlyVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 28, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 28, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 62, type: !18, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !23}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 53, size: 128, align: 32, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 55, baseType: !4, size: 128, align: 32)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 41, size: 96, align: 32, elements: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !23, file: !1, line: 43, baseType: !26, size: 96, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 28, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 28, size: 96, align: 32, elements: !28, templateParams: !32)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !27, file: !1, line: 28, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !27, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !27, file: !1, line: 28, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!13, !33}
!33 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!34 = !{!35, !59, !76, !77, !80, !82}
!35 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@MeshConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 22, type: !36, isLocal: false, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 22, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 22, size: 512, align: 32, elements: !39, templateParams: !56)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !38, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!56 = !{!13, !57, !58}
!57 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!58 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!59 = !DIGlobalVariable(name: "WorldIT", linkageName: "\01?WorldIT@MeshConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !1, line: 23, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !63, templateParams: !73)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !62, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!73 = !{!13, !74, !75}
!74 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!75 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!76 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@GlobalConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 28, type: !36, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !78, line: 41, type: !79, isLocal: false, isDefinition: true)
!78 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!80 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !78, line: 42, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!82 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !78, line: 43, type: !79, isLocal: false, isDefinition: true)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
