#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 4c3ddd382f886265d5cabf68476fb9fa.pdb
; shader hash: 4c3ddd382f886265d5cabf68476fb9fa
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CSConstants
; {
;
;   struct hostlayout.CSConstants
;   {
;
;       uint ViewportWidth;                           ; Offset:    0
;       uint ViewportHeight;                          ; Offset:    4
;       float InvTileDim;                             ; Offset:    8
;       float RcpZMagic;                              ; Offset:   12
;       uint TileCountX;                              ; Offset:   16
;       column_major float4x4 ViewProjMatrix;         ; Offset:   32
;   
;   } CSConstants;                                    ; Offset:    0 Size:    96
;
; }
;
; Resource bind info for lightBuffer
; {
;
;   struct hostlayout.struct.LightData
;   {
;
;       float3 pos;                                   ; Offset:    0
;       float radiusSq;                               ; Offset:   12
;       float3 color;                                 ; Offset:   16
;       uint type;                                    ; Offset:   28

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !52, globals: !65)
!1 = !DIFile(filename: "Shaders\5CFillLightGridCS_32.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !18, !30}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 49, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 49, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 105, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 105, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 105, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 108, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 108, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 108, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 108, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 108, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!21, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 30, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 30, size: 512, align: 32, elements: !32, templateParams: !49)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !31, file: !1, line: 30, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!49 = !{!21, !50, !51}
!50 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!51 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!52 = !{!53, !58, !62}
!53 = !DISubprogram(name: "main", scope: !54, file: !54, line: 59, type: !55, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!54 = !DIFile(filename: "Shaders/FillLightGridCS.hlsli", directory: "")
!55 = !DISubroutineType(types: !56)
!56 = !{null, !4, !4, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !8)
!58 = !DISubprogram(name: "GetTileIndex", linkageName: "\01?GetTileIndex@@YAIV?$vector@I$01@@I@Z", scope: !59, file: !59, line: 36, type: !60, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DIFile(filename: "Shaders/LightGrid.hlsli", directory: "")
!60 = !DISubroutineType(types: !61)
!61 = !{!57, !4, !57}
!62 = !DISubprogram(name: "GetTileOffset", linkageName: "\01?GetTileOffset@@YAII@Z", scope: !59, file: !59, line: 40, type: !63, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false)
!63 = !DISubroutineType(types: !64)
!64 = !{!57, !57}
!65 = !{!66, !68, !69, !71, !72, !73, !75, !76, !77, !78, !79, !80, !84, !85, !86, !99, !102, !104, !105}
!66 = !DIGlobalVariable(name: "ViewportWidth", linkageName: "\01?ViewportWidth@CSConstants@@3IB", scope: !0, file: !54, line: 26, type: !67, isLocal: false, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!68 = !DIGlobalVariable(name: "ViewportHeight", linkageName: "\01?ViewportHeight@CSConstants@@3IB", scope: !0, file: !54, line: 26, type: !67, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "InvTileDim", linkageName: "\01?InvTileDim@CSConstants@@3MB", scope: !0, file: !54, line: 27, type: !70, isLocal: false, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!71 = !DIGlobalVariable(name: "RcpZMagic", linkageName: "\01?RcpZMagic@CSConstants@@3MB", scope: !0, file: !54, line: 28, type: !70, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "TileCountX", linkageName: "\01?TileCountX@CSConstants@@3IB", scope: !0, file: !54, line: 29, type: !67, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "ViewProjMatrix", linkageName: "\01?ViewProjMatrix@CSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !54, line: 30, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!75 = !DIGlobalVariable(name: "minDepthUInt", linkageName: "\01?minDepthUInt@@3IA", scope: !0, file: !54, line: 38, type: !57, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?minDepthUInt@@3IA")
!76 = !DIGlobalVariable(name: "maxDepthUInt", linkageName: "\01?maxDepthUInt@@3IA", scope: !0, file: !54, line: 39, type: !57, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?maxDepthUInt@@3IA")
!77 = !DIGlobalVariable(name: "tileLightCountSphere", linkageName: "\01?tileLightCountSphere@@3IA", scope: !0, file: !54, line: 41, type: !57, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?tileLightCountSphere@@3IA")
!78 = !DIGlobalVariable(name: "tileLightCountCone", linkageName: "\01?tileLightCountCone@@3IA", scope: !0, file: !54, line: 42, type: !57, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?tileLightCountCone@@3IA")
!79 = !DIGlobalVariable(name: "tileLightCountConeShadowed", linkageName: "\01?tileLightCountConeShadowed@@3IA", scope: !0, file: !54, line: 43, type: !57, isLocal: false, isDefinition: true, variable: i32 addrspace(3)* @"\01?tileLightCountConeShadowed@@3IA")
!80 = !DIGlobalVariable(name: "tileLightIndicesSphere", linkageName: "\01?tileLightIndicesSphere@@3PAIA", scope: !0, file: !54, line: 45, type: !81, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?tileLightIndicesSphere@@3PAIA")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 4096, align: 32, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 128)
!84 = !DIGlobalVariable(name: "tileLightIndicesCone", linkageName: "\01?tileLightIndicesCone@@3PAIA", scope: !0, file: !54, line: 46, type: !81, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?tileLightIndicesCone@@3PAIA")
!85 = !DIGlobalVariable(name: "tileLightIndicesConeShadowed", linkageName: "\01?tileLightIndicesConeShadowed@@3PAIA", scope: !0, file: !54, line: 47, type: !81, isLocal: false, isDefinition: true, variable: [128 x i32] addrspace(3)* @"\01?tileLightIndicesConeShadowed@@3PAIA")
!86 = !DIGlobalVariable(name: "lightBuffer", linkageName: "\01?lightBuffer@@3V?$StructuredBuffer@ULightData@@@@A", scope: !0, file: !54, line: 33, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<LightData>", file: !1, line: 33, size: 928, align: 32, elements: !2, templateParams: !88)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "element", type: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !59, line: 18, size: 928, align: 32, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !90, file: !59, line: 20, baseType: !22, size: 96, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "radiusSq", scope: !90, file: !59, line: 21, baseType: !18, size: 32, align: 32, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !90, file: !59, line: 23, baseType: !22, size: 96, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !59, line: 24, baseType: !57, size: 32, align: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "coneDir", scope: !90, file: !59, line: 26, baseType: !22, size: 96, align: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "coneAngles", scope: !90, file: !59, line: 27, baseType: !14, size: 64, align: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "shadowTextureMatrix", scope: !90, file: !59, line: 29, baseType: !30, size: 512, align: 32, offset: 416)
!99 = !DIGlobalVariable(name: "depthTex", linkageName: "\01?depthTex@@3V?$Texture2D@M@@A", scope: !0, file: !54, line: 34, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 34, size: 64, align: 32, elements: !2, templateParams: !101)
!101 = !{!21}
!102 = !DIGlobalVariable(name: "lightGrid", linkageName: "\01?lightGrid@@3URWByteAddressBuffer@@A", scope: !0, file: !54, line: 35, type: !103, isLocal: false, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWByteAddressBuffer", file: !1, line: 35, size: 32, align: 32, elements: !2)
!104 = !DIGlobalVariable(name: "lightGridBitMask", linkageName: "\01?lightGridBitMask@@3URWByteAddressBuffer@@A", scope: !0, file: !54, line: 36, type: !103, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "tileLightBitMask", linkageName: "\01?tileLightBitMask@@3V?$vector@I$03@@A.v", scope: !0, file: !54, line: 49, type: !106, isLocal: false, isDefinition: true, variable: [4 x i32] addrspace(3)* @"\01?tileLightBitMask@@3V?$vector@I$03@@A.v")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 49, baseType: !107)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 49, size: 128, align: 32, elements: !108, templateParams: !113)
!108 = !{!109, !110, !111, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !107, file: !1, line: 49, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !107, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !107, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !107, file: !1, line: 49, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!113 = !{!11, !114}
!114 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!115 = !{i32 2, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!118 = !{!"Shaders\5CFillLightGridCS_32.hlsl", !"#define WORK_GROUP_SIZE_X 32\0D\0A#define WORK_GROUP_SIZE_Y 32\0D\0A#define WORK_GROUP_SIZE_Z 1\0D\0A\0D\0A#include \22FillLightGridCS.hlsli\22\0D\0A"}
!119 = !{!"Shaders\5CFillLightGridCS.hlsli", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):\09Alex Nankervis\0D\0A//\0D\0A\0D\0A#include \22LightGrid.hlsli\22\0D\0A\0D\0A// outdated warning about for-loop variable scope\0D\0A#pragma warning (disable: 3078)\0D\0A\0D\0A#define FLT_MIN         1.175494351e-38F        // min positive value\0D\0A#define FLT_MAX         3.402823466e+38F        // max value\0D\0A#define PI\09\09\09\093.1415926535f\0D\0A#define TWOPI\09\09\096.283185307f\0D\0A\0D\0Acbuffer CSConstants : register(b0)\0D\0A{\0D\0A    uint ViewportWidth, ViewportHeight;\0D\0A    float InvTileDim;\0D\0A    float RcpZMagic;\0D\0A    uint TileCountX;\0D\0A    float4x4 ViewProjMatrix;\0D\0A};\0D\0A\0D\0AStructuredBuffer<LightData> lightBuffer : register(t0);\0D\0ATexture2D<float> depthTex : register(t1);\0D\0ARWByteAddressBuffer lightGrid : register(u0);\0D\0ARWByteAddressBuffer lightGridBitMask : register(u1);\0D\0A\0D\0Agroupshared uint minDepthUInt;\0D\0Agroupshared uint maxDepthUInt;\0D\0A\0D\0Agroupshared uint tileLightCountSphere;\0D\0Agroupshared uint tileLightCountCone;\0D\0Agroupshared uint tileLightCountConeShadowed;\0D\0A\0D\0Agroupshared uint tileLightIndicesSphere[MAX_LIGHTS];\0D\0Agroupshared uint tileLightIndicesCone[MAX_LIGHTS];\0D\0Agroupshared uint tileLightIndicesConeShadowed[MAX_LIGHTS];\0D\0A\0D\0Agroupshared uint4 tileLightBitMask;\0D\0A\0D\0A#define _RootSig \5C\0D\0A    \22RootFlags(0), \22 \5C\0D\0A    \22CBV(b0), \22 \5C\0D\0A    \22DescriptorTable(SRV(t0, numDescriptors = 2)),\22 \5C\0D\0A    \22DescriptorTable(UAV(u0, numDescriptors = 2))\22\0D\0A\0D\0A[RootSignature(_RootSig)]\0D\0A[numthreads(8, 8, 1)]\0D\0Avoid main(\0D\0A    uint2 Gid : SV_GroupID,\0D\0A    uint2 GTid : SV_GroupThreadID,\0D\0A    uint GI : SV_GroupIndex)\0D\0A{\0D\0A    // initialize shared data\0D\0A    if (GI == 0)\0D\0A    {\0D\0A        tileLightCountSphere = 0;\0D\0A        tileLightCountCone = 0;\0D\0A        tileLightCountConeShadowed = 0;\0D\0A        tileLightBitMask = 0;\0D\0A        minDepthUInt = 0xffffffff;\0D\0A        maxDepthUInt = 0;\0D\0A    }\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A\0D\0A    // Read all depth values for this tile and compute the tile min and max values\0D\0A    for (uint dx = GTid.x; dx < WORK_GROUP_SIZE_X; dx += 8)\0D\0A    {\0D\0A        for (uint dy = GTid.y; dy < WORK_GROUP_SIZE_Y; dy += 8)\0D\0A        {\0D\0A            uint2 DTid = Gid * uint2(WORK_GROUP_SIZE_X, WORK_GROUP_SIZE_Y) + uint2(dx, dy);\0D\0A\0D\0A            // If pixel coordinates are in bounds...\0D\0A            if (DTid.x < ViewportWidth && DTid.y < ViewportHeight)\0D\0A            {\0D\0A                // Load and compare depth\0D\0A                uint depthUInt = asuint(depthTex[DTid.xy]);\0D\0A                InterlockedMin(minDepthUInt, depthUInt);\0D\0A                InterlockedMax(maxDepthUInt, depthUInt);\0D\0A            }\0D\0A        }\0D\0A    }\0D\0A\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A    //float tileMinDepth = asfloat(minDepthUInt);\0D\0A    //float tileMaxDepth = asfloat(maxDepthUInt);\0D\0A    float tileMinDepth = (rcp(asfloat(maxDepthUInt)) - 1.0) * RcpZMagic;\0D\0A    float tileMaxDepth = (rcp(asfloat(minDepthUInt)) - 1.0) * RcpZMagic;\0D\0A    float tileDepthRange = tileMaxDepth - tileMinDepth;\0D\0A    tileDepthRange = max(tileDepthRange, FLT_MIN); // don't allow a depth range of 0\0D\0A    float invTileDepthRange = rcp(tileDepthRange);\0D\0A    // TODO: near/far clipping planes seem to be falling apart at or near the max depth with infinite projections\0D\0A\0D\0A    // construct transform from world space to tile space (projection space constrained to tile area)\0D\0A    float2 invTileSize2X = float2(ViewportWidth, ViewportHeight) * InvTileDim;\0D\0A    // D3D-specific [0, 1] depth range ortho projection\0D\0A    // (but without negation of Z, since we already have that from the projection matrix)\0D\0A    float3 tileBias = float3(\0D\0A        -2.0 * float(Gid.x) + invTileSize2X.x - 1.0,\0D\0A        -2.0 * float(Gid.y) + invTileSize2X.y - 1.0,\0D\0A        -tileMinDepth * invTileDepthRange);\0D\0A    float4x4 projToTile = float4x4(\0D\0A        invTileSize2X.x, 0, 0, tileBias.x,\0D\0A        0, -invTileSize2X.y, 0, tileBias.y,\0D\0A        0, 0, invTileDepthRange, tileBias.z,\0D\0A        0, 0, 0, 1\0D\0A        );\0D\0A    float4x4 tileMVP = mul(projToTile, ViewProjMatrix);\0D\0A    \0D\0A    // extract frustum planes (these will be in world space)\0D\0A    float4 frustumPlanes[6];\0D\0A    frustumPlanes[0] = tileMVP[3] + tileMVP[0];\0D\0A    frustumPlanes[1] = tileMVP[3] - tileMVP[0];\0D\0A    frustumPlanes[2] = tileMVP[3] + tileMVP[1];\0D\0A    frustumPlanes[3] = tileMVP[3] - tileMVP[1];\0D\0A    frustumPlanes[4] = tileMVP[3] + tileMVP[2];\0D\0A    frustumPlanes[5] = tileMVP[3] - tileMVP[2];\0D\0A    for (int n = 0; n < 6; n++)\0D\0A    {\0D\0A        frustumPlanes[n] *= rsqrt(dot(frustumPlanes[n].xyz, frustumPlanes[n].xyz));\0D\0A    }\0D\0A\0D\0A    uint tileIndex = GetTileIndex(Gid.xy, TileCountX);\0D\0A    uint tileOffset = GetTileOffset(tileIndex);\0D\0A\0D\0A    uint4 perThreadLightBitMask = 0;\0D\0A\0D\0A    // find set of lights that overlap this tile\0D\0A    for (uint lightIndex = GI; lightIndex < MAX_LIGHTS; lightIndex += 64)\0D\0A    {\0D\0A        LightData lightData = lightBuffer[lightIndex];\0D\0A        float3 lightWorldPos = lightData.pos;\0D\0A        float lightCullRadius = sqrt(lightData.radiusSq);\0D\0A\0D\0A        bool overlapping = true;\0D\0A        for (int p = 0; p < 6; p++)\0D\0A        {\0D\0A            float d = dot(lightWorldPos, frustumPlanes[p].xyz) + frustumPlanes[p].w;\0D\0A            if (d < -lightCullRadius)\0D\0A            {\0D\0A                overlapping = false;\0D\0A            }\0D\0A        }\0D\0A        \0D\0A        if (!overlapping)\0D\0A            continue;\0D\0A\0D\0A        uint slot;\0D\0A\0D\0A        switch (lightData.type)\0D\0A        {\0D\0A        case 0: // sphere\0D\0A            InterlockedAdd(tileLightCountSphere, 1, slot);\0D\0A            tileLightIndicesSphere[slot] = lightIndex;\0D\0A            break;\0D\0A\0D\0A        case 1: // cone\0D\0A            InterlockedAdd(tileLightCountCone, 1, slot);\0D\0A            tileLightIndicesCone[slot] = lightIndex;\0D\0A            break;\0D\0A\0D\0A        case 2: // cone w/ shadow map\0D\0A            InterlockedAdd(tileLightCountConeShadowed, 1, slot);\0D\0A            tileLightIndicesConeShadowed[slot] = lightIndex;\0D\0A            break;\0D\0A        }\0D\0A\0D\0A        // update bitmask\0D\0A        InterlockedOr(tileLightBitMask[lightIndex / 32], 1u << (lightIndex % 32));\0D\0A    }\0D\0A\0D\0A    GroupMemoryBarrierWithGroupSync();\0D\0A\0D\0A    if (GI == 0)\0D\0A    {\0D\0A        uint lightCount = \0D\0A            ((tileLightCountSphere & 0xff) << 0) |\0D\0A            ((tileLightCountCone & 0xff) << 8) |\0D\0A            ((tileLightCountConeShadowed & 0xff) << 16);\0D\0A        lightGrid.Store(tileOffset + 0, lightCount);\0D\0A\0D\0A        uint storeOffset = tileOffset + 4;\0D\0A        uint n;\0D\0A        for (n = 0; n < tileLightCountSphere; n++)\0D\0A        {\0D\0A            lightGrid.Store(storeOffset, tileLightIndicesSphere[n]);\0D\0A            storeOffset += 4;\0D\0A        }\0D\0A        for (n = 0; n < tileLightCountCone; n++)\0D\0A        {\0D\0A            lightGrid.Store(storeOffset, tileLightIndicesCone[n]);\0D\0A            storeOffset += 4;\0D\0A        }\0D\0A        for (n = 0; n < tileLightCountConeShadowed; n++)\0D\0A        {\0D\0A            lightGrid.Store(storeOffset, tileLightIndicesConeShadowed[n]);\0D\0A            storeOffset += 4;\0D\0A        }\0D\0A\0D\0A        lightGridBitMask.Store4(tileIndex * 16, tileLightBitMask);\0D\0A    }\0D\0A}\0D\0A"}
!120 = !{!"Shaders\5CLightGrid.hlsli", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):\09Alex Nankervis\0D\0A//\0D\0A\0D\0A// keep in sync with C code\0D\0A#define MAX_LIGHTS 128\0D\0A#define TILE_SIZE (4 + MAX_LIGHTS * 4)\0D\0A\0D\0Astruct LightData\0D\0A{\0D\0A    float3 pos;\0D\0A    float radiusSq;\0D\0A\0D\0A    float3 color;\0D\0A    uint type;\0D\0A\0D\0A    float3 coneDir;\0D\0A    float2 coneAngles; // x = 1.0f / (cos(coneInner) - cos(coneOuter)), y = cos(coneOuter)\0D\0A\0D\0A    float4x4 shadowTextureMatrix;\0D\0A};\0D\0A\0D\0Auint2 GetTilePos(float2 pos, float2 invTileDim)\0D\0A{\0D\0A    return pos * invTileDim;\0D\0A}\0D\0Auint GetTileIndex(uint2 tilePos, uint tileCountX)\0D\0A{\0D\0A    return tilePos.y * tileCountX + tilePos.x;\0D\0A}\0D\0Auint GetTileOffset(uint tileIndex)\0D\0A{\0D\0A    return tileIndex * TILE_SIZE;\0D\0A}\0D\0A"}
!121 = !{!"_GAMING_DESKTOP=1", !"_GAMING_DESKTOP=1"}
!122 = !{!"Shaders\5CFillLightGridCS_32.hlsl"}
!123 = !{!"-E", !"main", !"-T", !"cs_6_2", !"/D", !"_GAMING_DESKTOP=1", !"/Zi", !"-Qembed_debug", !"-D", !"_GAMING_DESKTOP=1"}
!124 = !{i32 1, i32 2}
!125 = !{i32 1, i32 6}
!126 = !{!"cs", i32 6, i32 2}
!127 = !{!128, !133, !136, null}
!128 = !{!129, !131}
!129 = !{i32 0, %"hostlayout.class.StructuredBuffer<LightData>"* undef, !"lightBuffer", i32 0, i32 0, i32 1, i32 12, i32 0, !130}
!130 = !{i32 1, i32 116}
!131 = !{i32 1, %"class.Texture2D<float>"* undef, !"depthTex", i32 0, i32 1, i32 1, i32 2, i32 0, !132}
!132 = !{i32 0, i32 9}
!133 = !{!134, !135}
!134 = !{i32 0, %struct.RWByteAddressBuffer* undef, !"lightGrid", i32 0, i32 0, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!135 = !{i32 1, %struct.RWByteAddressBuffer* undef, !"lightGridBitMask", i32 0, i32 1, i32 1, i32 11, i1 false, i1 false, i1 false, null}
!136 = !{!137}
!137 = !{i32 0, %hostlayout.CSConstants* undef, !"CSConstants", i32 0, i32 0, i32 1, i32 96, null}
!138 = !{i32 0, %hostlayout.CSConstants undef, !139, %hostlayout.struct.LightData undef, !147, %"hostlayout.class.StructuredBuffer<LightData>" undef, !155}
!139 = !{i32 96, !140, !141, !142, !143, !144, !145}
!140 = !{i32 6, !"ViewportWidth", i32 3, i32 0, i32 7, i32 5}
!141 = !{i32 6, !"ViewportHeight", i32 3, i32 4, i32 7, i32 5}
!142 = !{i32 6, !"InvTileDim", i32 3, i32 8, i32 7, i32 9}
!143 = !{i32 6, !"RcpZMagic", i32 3, i32 12, i32 7, i32 9}
!144 = !{i32 6, !"TileCountX", i32 3, i32 16, i32 7, i32 5}
!145 = !{i32 6, !"ViewProjMatrix", i32 2, !146, i32 3, i32 32, i32 7, i32 9}
!146 = !{i32 4, i32 4, i32 2}
!147 = !{i32 128, !148, !149, !150, !151, !152, !153, !154}
!148 = !{i32 6, !"pos", i32 3, i32 0, i32 7, i32 9}
!149 = !{i32 6, !"radiusSq", i32 3, i32 12, i32 7, i32 9}
!150 = !{i32 6, !"color", i32 3, i32 16, i32 7, i32 9}
!151 = !{i32 6, !"type", i32 3, i32 28, i32 7, i32 5}
!152 = !{i32 6, !"coneDir", i32 3, i32 32, i32 7, i32 9}
!153 = !{i32 6, !"coneAngles", i32 3, i32 48, i32 7, i32 9}
!154 = !{i32 6, !"shadowTextureMatrix", i32 2, !146, i32 3, i32 64, i32 7, i32 9}
!155 = !{i32 128, !156}
!156 = !{i32 6, !"h", i32 3, i32 0}
!157 = !{i32 1, void ()* @main, !158}
!158 = !{!159}
!159 = !{i32 0, !2, !2}
!160 = !{void ()* @main, !"main", null, !127, !161}
!161 = !{i32 0, i64 16, i32 4, !162}
!162 = !{i32 8, i32 8, i32 1}
!163 = !DILocation(line: 87, column: 41, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !54, line: 85, column: 13)
!165 = distinct !DILexicalBlock(scope: !166, file: !54, line: 84, column: 17)
!166 = distinct !DILexicalBlock(scope: !167, file: !54, line: 80, column: 9)
!167 = distinct !DILexicalBlock(scope: !168, file: !54, line: 79, column: 9)
!168 = distinct !DILexicalBlock(scope: !169, file: !54, line: 79, column: 9)
!169 = distinct !DILexicalBlock(scope: !170, file: !54, line: 78, column: 5)
!170 = distinct !DILexicalBlock(scope: !171, file: !54, line: 77, column: 5)
!171 = distinct !DILexicalBlock(scope: !53, file: !54, line: 77, column: 5)
!172 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GI", arg: 3, scope: !53, file: !54, line: 62, type: !57)
!173 = !DIExpression()
!174 = !DILocation(line: 62, column: 10, scope: !53)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "GTid", arg: 2, scope: !53, file: !54, line: 61, type: !4)
!176 = !DIExpression(DW_OP_bit_piece, 0, 32)
!177 = !DILocation(line: 61, column: 11, scope: !53)
!178 = !DIExpression(DW_OP_bit_piece, 32, 32)
!179 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Gid", arg: 1, scope: !53, file: !54, line: 60, type: !4)
!180 = !DILocation(line: 60, column: 11, scope: !53)
!181 = !DILocation(line: 65, column: 12, scope: !182)
!182 = distinct !DILexicalBlock(scope: !53, file: !54, line: 65, column: 9)
!183 = !DILocation(line: 65, column: 9, scope: !53)
!184 = !DILocation(line: 67, column: 30, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !54, line: 66, column: 5)
!186 = !{!187, !187, i64 0}
!187 = !{!"int", !188, i64 0}
!188 = !{!"omnipotent char", !189, i64 0}
!189 = !{!"Simple C/C++ TBAA"}
!190 = !DILocation(line: 68, column: 28, scope: !185)
!191 = !DILocation(line: 69, column: 36, scope: !185)
!192 = !DILocation(line: 70, column: 26, scope: !185)
!193 = !DILocation(line: 71, column: 22, scope: !185)
!194 = !DILocation(line: 72, column: 22, scope: !185)
!195 = !DILocation(line: 73, column: 5, scope: !185)
!196 = !DILocation(line: 74, column: 5, scope: !53)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !171, file: !54, line: 77, type: !57)
!198 = !DILocation(line: 77, column: 15, scope: !171)
!199 = !DILocation(line: 77, column: 31, scope: !170)
!200 = !DILocation(line: 77, column: 5, scope: !171)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dy", scope: !168, file: !54, line: 79, type: !57)
!202 = !DILocation(line: 79, column: 19, scope: !168)
!203 = !DILocation(line: 79, column: 35, scope: !167)
!204 = !DILocation(line: 79, column: 9, scope: !168)
!205 = !DILocation(line: 81, column: 30, scope: !166)
!206 = !DILocation(line: 81, column: 76, scope: !166)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "DTid", scope: !166, file: !54, line: 81, type: !4)
!208 = !DILocation(line: 81, column: 19, scope: !166)
!209 = !DILocation(line: 84, column: 26, scope: !165)
!210 = !DILocation(line: 84, column: 24, scope: !165)
!211 = !DILocation(line: 84, column: 52, scope: !165)
!212 = !DILocation(line: 84, column: 50, scope: !165)
!213 = !DILocation(line: 84, column: 40, scope: !165)
!214 = !DILocation(line: 84, column: 17, scope: !166)
!215 = !DILocation(line: 87, column: 34, scope: !164)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depthUInt", scope: !164, file: !54, line: 87, type: !57)
!217 = !DILocation(line: 87, column: 22, scope: !164)
!218 = !DILocation(line: 88, column: 17, scope: !164)
!219 = !DILocation(line: 89, column: 17, scope: !164)
!220 = !DILocation(line: 90, column: 13, scope: !164)
!221 = !DILocation(line: 79, column: 59, scope: !167)
!222 = !DILocation(line: 77, column: 55, scope: !170)
!223 = !DILocation(line: 94, column: 5, scope: !53)
!224 = !DILocation(line: 97, column: 39, scope: !53)
!225 = !DILocation(line: 97, column: 31, scope: !53)
!226 = !DILocation(line: 97, column: 27, scope: !53)
!227 = !DILocation(line: 97, column: 54, scope: !53)
!228 = !DILocation(line: 97, column: 63, scope: !53)
!229 = !DILocation(line: 97, column: 61, scope: !53)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileMinDepth", scope: !53, file: !54, line: 97, type: !18)
!231 = !DILocation(line: 97, column: 11, scope: !53)
!232 = !DILocation(line: 98, column: 39, scope: !53)
!233 = !DILocation(line: 98, column: 31, scope: !53)
!234 = !DILocation(line: 98, column: 27, scope: !53)
!235 = !DILocation(line: 98, column: 54, scope: !53)
!236 = !DILocation(line: 98, column: 63, scope: !53)
!237 = !DILocation(line: 98, column: 61, scope: !53)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileMaxDepth", scope: !53, file: !54, line: 98, type: !18)
!239 = !DILocation(line: 98, column: 11, scope: !53)
!240 = !DILocation(line: 99, column: 41, scope: !53)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileDepthRange", scope: !53, file: !54, line: 99, type: !18)
!242 = !DILocation(line: 99, column: 11, scope: !53)
!243 = !DILocation(line: 100, column: 22, scope: !53)
!244 = !DILocation(line: 101, column: 31, scope: !53)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invTileDepthRange", scope: !53, file: !54, line: 101, type: !18)
!246 = !DILocation(line: 101, column: 11, scope: !53)
!247 = !DILocation(line: 105, column: 35, scope: !53)
!248 = !DILocation(line: 105, column: 50, scope: !53)
!249 = !DILocation(line: 105, column: 68, scope: !53)
!250 = !DILocation(line: 105, column: 66, scope: !53)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "invTileSize2X", scope: !53, file: !54, line: 105, type: !14)
!252 = !DILocation(line: 105, column: 12, scope: !53)
!253 = !DILocation(line: 109, column: 22, scope: !53)
!254 = !DILocation(line: 109, column: 14, scope: !53)
!255 = !DILocation(line: 109, column: 47, scope: !53)
!256 = !DILocation(line: 110, column: 22, scope: !53)
!257 = !DILocation(line: 110, column: 14, scope: !53)
!258 = !DILocation(line: 110, column: 47, scope: !53)
!259 = !DILocation(line: 111, column: 23, scope: !53)
!260 = !DILocation(line: 114, column: 12, scope: !53)
!261 = !DILocation(line: 118, column: 40, scope: !53)
!262 = !DILocation(line: 118, column: 24, scope: !53)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileMVP", scope: !53, file: !54, line: 118, type: !30)
!264 = !DILocation(line: 118, column: 14, scope: !53)
!265 = !DIExpression(DW_OP_bit_piece, 64, 32)
!266 = !DIExpression(DW_OP_bit_piece, 96, 32)
!267 = !DIExpression(DW_OP_bit_piece, 128, 32)
!268 = !DIExpression(DW_OP_bit_piece, 160, 32)
!269 = !DIExpression(DW_OP_bit_piece, 192, 32)
!270 = !DIExpression(DW_OP_bit_piece, 224, 32)
!271 = !DIExpression(DW_OP_bit_piece, 256, 32)
!272 = !DIExpression(DW_OP_bit_piece, 288, 32)
!273 = !DIExpression(DW_OP_bit_piece, 320, 32)
!274 = !DIExpression(DW_OP_bit_piece, 352, 32)
!275 = !DIExpression(DW_OP_bit_piece, 384, 32)
!276 = !DIExpression(DW_OP_bit_piece, 416, 32)
!277 = !DIExpression(DW_OP_bit_piece, 448, 32)
!278 = !DIExpression(DW_OP_bit_piece, 480, 32)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frustumPlanes", scope: !53, file: !54, line: 121, type: !280)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 768, align: 32, elements: !289)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 121, baseType: !282)
!282 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 121, size: 128, align: 32, elements: !283, templateParams: !288)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !282, file: !1, line: 121, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !282, file: !1, line: 121, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !282, file: !1, line: 121, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !282, file: !1, line: 121, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!288 = !{!21, !114}
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DILocation(line: 121, column: 12, scope: !53)
!292 = !{i32 0, i32 128, i32 6}
!293 = !{i32 32, i32 128, i32 6}
!294 = !{i32 64, i32 128, i32 6}
!295 = !{i32 96, i32 128, i32 6}
!296 = !DILocation(line: 122, column: 35, scope: !53)
!297 = !DILocation(line: 122, column: 5, scope: !53)
!298 = !DILocation(line: 122, column: 22, scope: !53)
!299 = !DILocation(line: 123, column: 35, scope: !53)
!300 = !DILocation(line: 123, column: 5, scope: !53)
!301 = !DILocation(line: 123, column: 22, scope: !53)
!302 = !DILocation(line: 124, column: 35, scope: !53)
!303 = !DILocation(line: 124, column: 5, scope: !53)
!304 = !DILocation(line: 124, column: 22, scope: !53)
!305 = !DILocation(line: 125, column: 35, scope: !53)
!306 = !DILocation(line: 125, column: 5, scope: !53)
!307 = !DILocation(line: 125, column: 22, scope: !53)
!308 = !DILocation(line: 126, column: 35, scope: !53)
!309 = !DILocation(line: 126, column: 5, scope: !53)
!310 = !DILocation(line: 126, column: 22, scope: !53)
!311 = !DILocation(line: 127, column: 35, scope: !53)
!312 = !DILocation(line: 127, column: 5, scope: !53)
!313 = !DILocation(line: 127, column: 22, scope: !53)
!314 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !315, file: !54, line: 128, type: !13)
!315 = distinct !DILexicalBlock(scope: !53, file: !54, line: 128, column: 5)
!316 = !DILocation(line: 128, column: 14, scope: !315)
!317 = !DILocation(line: 128, column: 5, scope: !315)
!318 = !DILocation(line: 130, column: 26, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !54, line: 129, column: 5)
!320 = distinct !DILexicalBlock(scope: !315, file: !54, line: 128, column: 5)
!321 = !DILocation(line: 130, column: 61, scope: !319)
!322 = !DILocation(line: 130, column: 35, scope: !319)
!323 = !DILocation(line: 130, column: 29, scope: !319)
!324 = !DILocation(line: 130, column: 9, scope: !319)
!325 = !DILocation(line: 128, column: 29, scope: !320)
!326 = !DILocation(line: 133, column: 43, scope: !53)
!327 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tileCountX", arg: 2, scope: !58, file: !59, line: 36, type: !57)
!328 = !DILocation(line: 36, column: 39, scope: !58, inlinedAt: !329)
!329 = distinct !DILocation(line: 133, column: 22, scope: !53)
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tilePos", arg: 1, scope: !58, file: !59, line: 36, type: !4)
!331 = !DILocation(line: 36, column: 25, scope: !58, inlinedAt: !329)
!332 = !DILocation(line: 38, column: 22, scope: !58, inlinedAt: !329)
!333 = !DILocation(line: 38, column: 35, scope: !58, inlinedAt: !329)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileIndex", scope: !53, file: !54, line: 133, type: !57)
!335 = !DILocation(line: 133, column: 10, scope: !53)
!336 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tileIndex", arg: 1, scope: !62, file: !59, line: 40, type: !57)
!337 = !DILocation(line: 40, column: 25, scope: !62, inlinedAt: !338)
!338 = distinct !DILocation(line: 134, column: 23, scope: !53)
!339 = !DILocation(line: 42, column: 22, scope: !62, inlinedAt: !338)
!340 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tileOffset", scope: !53, file: !54, line: 134, type: !57)
!341 = !DILocation(line: 134, column: 10, scope: !53)
!342 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lightIndex", scope: !343, file: !54, line: 139, type: !57)
!343 = distinct !DILexicalBlock(scope: !53, file: !54, line: 139, column: 5)
!344 = !DILocation(line: 139, column: 15, scope: !343)
!345 = !DILocation(line: 139, column: 43, scope: !346)
!346 = distinct !DILexicalBlock(scope: !343, file: !54, line: 139, column: 5)
!347 = !DILocation(line: 139, column: 5, scope: !343)
!348 = !DILocation(line: 141, column: 31, scope: !349)
!349 = distinct !DILexicalBlock(scope: !346, file: !54, line: 140, column: 5)
