#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TANGENT                  0   xyz         3     NONE   float   xyz 
; BITANGENT                0   xyz         4     NONE   float   xyz 
; SV_VertexID              0   x           5   VERTID    uint       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; WorldPos                 0   xyz         1     NONE   float   xyz 
; TexCoord                 0   xy          2     NONE   float   xy  
; TexCoord                 1   xyz         3     NONE   float   xyz 
; TexCoord                 2   xyz         4     NONE   float   xyz 
; Normal                   0   xyz         5     NONE   float   xyz 
; Tangent                  0   xyz         6     NONE   float   xyz 
; Bitangent                0   xyz         7     NONE   float   xyz 
;
; shader debug name: 6f1827ca98d304bb96344f2386ea9cac.pdb
; shader hash: 6f1827ca98d304bb96344f2386ea9cac
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !54)
!1 = !DIFile(filename: "Shaders\5CModelViewerVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 26, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 26, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 54, type: !18, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !45, !52}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 38, size: 768, align: 32, elements: !21)
!21 = !{!22, !23, !32, !40, !41, !42, !43, !44}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 40, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "worldPos", scope: !20, file: !1, line: 41, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 21, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 21, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 21, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 21, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !20, file: !1, line: 42, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 26, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 26, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "viewDir", scope: !20, file: !1, line: 43, baseType: !24, size: 96, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "shadowCoord", scope: !20, file: !1, line: 44, baseType: !24, size: 96, align: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !1, line: 45, baseType: !24, size: 96, align: 32, offset: 480)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !20, file: !1, line: 46, baseType: !24, size: 96, align: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !20, file: !1, line: 47, baseType: !24, size: 96, align: 32, offset: 672)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 29, size: 448, align: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !45, file: !1, line: 31, baseType: !24, size: 96, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "texcoord0", scope: !45, file: !1, line: 32, baseType: !33, size: 64, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !45, file: !1, line: 33, baseType: !24, size: 96, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !45, file: !1, line: 34, baseType: !24, size: 96, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bitangent", scope: !45, file: !1, line: 35, baseType: !24, size: 96, align: 32, offset: 352)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 26, baseType: !53)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !{!55, !79, !80, !82, !84, !87, !89}
!55 = !DIGlobalVariable(name: "modelToProjection", linkageName: "\01?modelToProjection@VSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 19, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 19, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 19, size: 512, align: 32, elements: !59, templateParams: !76)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !58, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!76 = !{!13, !77, !78}
!77 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!78 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!79 = !DIGlobalVariable(name: "modelToShadow", linkageName: "\01?modelToShadow@VSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 20, type: !56, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "ViewerPos", linkageName: "\01?ViewerPos@VSConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 21, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!82 = !DIGlobalVariable(name: "materialIdx", linkageName: "\01?materialIdx@StartVertex@@3IB", scope: !0, file: !1, line: 26, type: !83, isLocal: false, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!84 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !85, line: 41, type: !86, isLocal: false, isDefinition: true)
!85 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!87 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !85, line: 42, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!89 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !85, line: 43, type: !86, isLocal: false, isDefinition: true)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
