#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 3   xyz         1     NONE   float   xyz 
;
; shader debug name: da61c1bc59f20c41908a2162fac7f74b.pdb
; shader hash: da61c1bc59f20c41908a2162fac7f74b
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 3                 linear       
;
; Buffer Definitions:
;
; cbuffer VSConstants
; {
;
;   struct hostlayout.VSConstants
;   {
;
;       column_major float4x4 ProjInverse;            ; Offset:    0
;       column_major float3x3 ViewInverse;            ; Offset:   64
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !48)
!1 = !DIFile(filename: "Shaders\5CSkyboxVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 31, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 31, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 31, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 31, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 31, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 31, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 31, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 29, type: !33, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !47}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 22, size: 224, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !35, file: !1, line: 24, baseType: !22, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "viewDir", scope: !35, file: !1, line: 25, baseType: !39, size: 96, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 19, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 19, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!11, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 19, baseType: !18)
!48 = !{!49, !73, !90, !93, !95}
!49 = !DIGlobalVariable(name: "ProjInverse", linkageName: "\01?ProjInverse@VSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 18, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 18, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 18, size: 512, align: 32, elements: !53, templateParams: !70)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !52, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!70 = !{!11, !71, !72}
!71 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!72 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!73 = !DIGlobalVariable(name: "ViewInverse", linkageName: "\01?ViewInverse@VSConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !1, line: 19, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 19, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 19, size: 288, align: 32, elements: !77, templateParams: !87)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !76, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!87 = !{!11, !88, !89}
!88 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!89 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!90 = !DIGlobalVariable(name: "defaultSampler", linkageName: "\01?defaultSampler@@3USamplerState@@A", scope: !0, file: !91, line: 41, type: !92, isLocal: false, isDefinition: true)
!91 = !DIFile(filename: "Shaders/Common.hlsli", directory: "")
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 41, size: 32, align: 32, elements: !2)
!93 = !DIGlobalVariable(name: "shadowSampler", linkageName: "\01?shadowSampler@@3USamplerComparisonState@@A", scope: !0, file: !91, line: 42, type: !94, isLocal: false, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerComparisonState", file: !1, line: 42, size: 32, align: 32, elements: !2)
!95 = !DIGlobalVariable(name: "cubeMapSampler", linkageName: "\01?cubeMapSampler@@3USamplerState@@A", scope: !0, file: !91, line: 43, type: !92, isLocal: false, isDefinition: true)
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!99 = !{!"Shaders\5CSkyboxVS.hlsl", !"//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A// Developed by Minigraph\0D\0A//\0D\0A// Author(s):  James Stanard\0D\0A//\0D\0A\0D\0A#include \22Common.hlsli\22\0D\0A\0D\0Acbuffer VSConstants : register(b0)\0D\0A{\0D\0A    float4x4 ProjInverse;\0D\0A    float3x3 ViewInverse;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float3 viewDir : TEXCOORD3;\0D\0A};\0D\0A\0D\0A[RootSignature(Renderer_RootSig)]\0D\0AVSOutput main(uint VertID : SV_VertexID)\0D\0A{\0D\0A    float2 ScreenUV = float2(uint2(VertID, VertID << 1) & 2);\0D\0A    float4 ProjectedPos = float4(lerp(float2(-1, 1), float2(1, -1), ScreenUV), 0, 1);\0D\0A    float4 PosViewSpace = mul(ProjInverse, ProjectedPos);\0D\0A\0D\0A    VSOutput vsOutput;\0D\0A    vsOutput.position = ProjectedPos;\0D\0A    vsOutput.viewDir = mul(ViewInverse, PosViewSpace.xyz / PosViewSpace.w);\0D\0A\0D\0A    return vsOutput;\0D\0A}\0D\0A"}
